skeleton_files/emacs_config.org
#+TITLE: GNU EMACS CONFIGURATION
#+AUTHOR: Anirban Chakraborty
#+DESCRIPTION: ACH's personal Emacs config.
#+STARTUP: showeverything

* Introduction

This org file is basically a manual of my entire emacs configuration. This file is updatable.

* Start of the Configuration File

** Top contents

This is the header and introductory comments for a GNU Emacs configuration file. The author/maintainer of this file is Anirban Chakraborty, whose email address and GitHub page are provided. This file is not part of the official GNU Emacs software but is distributed under the terms of the GNU General Public License version 3 or any later version. It comes without any warranty. The commentary section indicates that this file provides a complete configuration for GNU Emacs.

#+BEGIN_SRC emacs-lisp

;;; emacs_config.el --- GNU Emacs Configuration  -*- lexical-binding: t; -*-

;; Copyright © 2022-2023, Anirban Chakraborty <achakraborty2591@gmail.com>

;; Author/Maintainer: Anirban Chakraborty <achakraborty2591@gmail.com>
;; Homepage: https://github.com/achakraborty2591/ACH-Emacs-Config

;; This file is NOT part of GNU Emacs.

;; This is free software: you can redistribute it and/or modify it under
;; the terms of the GNU General Public License as published by the Free
;; Software Foundation, either version 3 of the License, or (at your
;; option) any later version.

;; This software is distributed in the hope that it will be useful, but
;; WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
;; Public License for more details.

;; You should have received a copy of the GNU General Public License along
;; with this software. If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; This is a complete configuration of GNU Emacs.

;;; Code:

#+END_SRC

* Garbage Collection

This Emacs Lisp code sets two configuration parameters. The first line sets the garbage collection threshold to 100,000,000 bytes, which means that automatic memory management will only start when this amount of memory has been allocated since the last garbage collection. This can help improve performance by reducing the frequency of garbage collections. The second line sets the maximum depth of the variable binding stack (also known as specpdl) to 5000. This limits how deeply functions and macros can nest in their use of local variables, helping prevent infinite recursion or excessively deep nesting from consuming all available memory.

#+BEGIN_SRC emacs-lisp

;; Set garbage collection threshold to 100000000
(setq gc-cons-threshold 100000000)

;; Set maximum depth of the variable binding stack (specpdl) to 5000
(setq max-specpdl-size 5000)

#+END_SRC

* Personal Information

The provided block of code is used to set user-specific information in Emacs. It sets the *user-full-name* as "Anirban Chakraborty" and the *user-mail-address* as "achakraborty2591@gmail.com". This information can be utilized by various Emacs packages that require user details.

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Anirban Chakraborty")
  (setq user-mail-address "achakraborty2591@gmail.com")
#+END_SRC

* Package Manager

