emacs_config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU EMACS CONFIGURATION</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Anirban Chakraborty" />
<meta name="description" content="ACH's personal Emacs config."
 />
<link rel="stylesheet" href="https://raw.githack.com/achakraborty2591/emacs-config-website/main/skeleton_files/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">GNU EMACS CONFIGURATION</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf6dcc30">Introduction</a></li>
<li><a href="#org2c1b930">Start of the Configuration File</a>
<ul>
<li><a href="#orgdd5adbf">Top contents</a></li>
</ul>
</li>
<li><a href="#orgafc2706">Garbage Collection</a></li>
<li><a href="#org1890927">Personal Information</a></li>
<li><a href="#orgfd14e25">Package Manager</a>
<ul>
<li><a href="#org42bfa01">Elpaca Package Manager</a></li>
<li><a href="#org69f9bed">Automatic Package Update</a></li>
</ul>
</li>
<li><a href="#orgcc51c69">Startup</a></li>
<li><a href="#org3630839">Auto-Save</a></li>
<li><a href="#orgfdcc512">Appearance</a>
<ul>
<li><a href="#org8ab8f0b">OS X Specific Settings</a></li>
<li><a href="#org7a07a15">Color Theme Settings</a></li>
<li><a href="#org456a7da">Diminish Settings</a></li>
<li><a href="#org048d2c7">Fancy Compilation Settings</a></li>
<li><a href="#orgd889ed2">Counsel Settings</a></li>
<li><a href="#orgc8789ec">Dired Settings</a></li>
<li><a href="#org4292a79">Help Settings</a></li>
<li><a href="#org23c0bb5">Neotree Settings</a></li>
<li><a href="#org8ef9be8">Icon Settings</a></li>
<li><a href="#orgc0c2ada">Dashboard Settings</a></li>
<li><a href="#orge2658a1">Which Key Settings</a></li>
</ul>
</li>
<li><a href="#org1e4451e">Keybindings</a>
<ul>
<li><a href="#org6f22dd0">Evil Mode Settings</a></li>
<li><a href="#org7c573d4">General Keybinding Settings</a></li>
</ul>
</li>
<li><a href="#org43e20e5">Terminal Frameworks</a>
<ul>
<li><a href="#orgb2e915c">Vterm Settings</a></li>
<li><a href="#org438e4bf">Eshell Settings</a></li>
</ul>
</li>
<li><a href="#orgdd07299">Completion Frameworks</a>
<ul>
<li><a href="#org566565d">Vertico Mode Settings</a></li>
<li><a href="#orgf72d535">Consult Mode Settings</a></li>
</ul>
</li>
<li><a href="#org0fc3c50">Programming Settings</a>
<ul>
<li><a href="#org11b416a">Flycheck Settings</a></li>
<li><a href="#org8646ba3">Highlight TODO Settings</a></li>
<li><a href="#org34546da">LSP Settings</a></li>
<li><a href="#orgfaf11de">Git Settings</a></li>
<li><a href="#orgbc832fd">YASnippet Settings</a></li>
<li><a href="#org6f1096f">Markdown Settings</a></li>
<li><a href="#org5d95754">JSON Settings</a></li>
<li><a href="#orga53765d">LaTeX Settings</a></li>
<li><a href="#org5b2385c">Python Settings</a></li>
<li><a href="#org1eea246">Typescript Settings</a></li>
<li><a href="#org3067956">Verilog-Mode Settings</a></li>
<li><a href="#org9b90441">Emacs Lisp Settings</a></li>
<li><a href="#org6f21902">YAML Settings</a></li>
<li><a href="#orga860f7e">Scala Settings</a></li>
<li><a href="#org6bc37dd">ORG Settings</a></li>
</ul>
</li>
<li><a href="#org5fe9e3d">Miscellaneous Packages</a></li>
<li><a href="#org6b6eeeb">List of all Keybindings</a></li>
<li><a href="#orgf752729">End of the Configuration File</a>
<ul>
<li><a href="#orgf1a48ff">Bottom Contents</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6dcc30" class="outline-2">
<h2 id="orgf6dcc30">Introduction</h2>
<div class="outline-text-2" id="text-orgf6dcc30">
<p>
This org file is basically a manual of my entire emacs configuration. This file is updatable.
</p>
</div>
</div>

<div id="outline-container-org2c1b930" class="outline-2">
<h2 id="org2c1b930">Start of the Configuration File</h2>
<div class="outline-text-2" id="text-org2c1b930">
</div>
<div id="outline-container-orgdd5adbf" class="outline-3">
<h3 id="orgdd5adbf">Top contents</h3>
<div class="outline-text-3" id="text-orgdd5adbf">
<p>
This is the header and introductory comments for a GNU Emacs configuration file. The author/maintainer of this file is Anirban Chakraborty, whose email address and GitHub page are provided. This file is not part of the official GNU Emacs software but is distributed under the terms of the GNU General Public License version 3 or any later version. It comes without any warranty. The commentary section indicates that this file provides a complete configuration for GNU Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">emacs_config.el --- GNU Emacs Configuration  -*- lexical-binding: t; -*-</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Copyright &#169; 2022-2023, Anirban Chakraborty <a href="mailto:achakraborty2591%40gmail.com">&lt;achakraborty2591@gmail.com&gt;</a></span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Author/Maintainer: Anirban Chakraborty <a href="mailto:achakraborty2591%40gmail.com">&lt;achakraborty2591@gmail.com&gt;</a></span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Homepage: https://github.com/achakraborty2591/ACH-Emacs-Config</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This file is NOT part of GNU Emacs.</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This is free software: you can redistribute it and/or modify it under</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">the terms of the GNU General Public License as published by the Free</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Software Foundation, either version 3 of the License, or (at your</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">option) any later version.</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This software is distributed in the hope that it will be useful, but</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Public License for more details.</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">You should have received a copy of the GNU General Public License along</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">with this software. If not, see <a href="https://www.gnu.org/licenses/">&lt;https://www.gnu.org/licenses/&gt;</a>.</span>

<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">Commentary:</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This is a complete configuration of GNU Emacs.</span>

<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">Code:</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgafc2706" class="outline-2">
<h2 id="orgafc2706">Garbage Collection</h2>
<div class="outline-text-2" id="text-orgafc2706">
<p>
This Emacs Lisp code sets two configuration parameters. The first line sets the garbage collection threshold to 100,000,000 bytes, which means that automatic memory management will only start when this amount of memory has been allocated since the last garbage collection. This can help improve performance by reducing the frequency of garbage collections. The second line sets the maximum depth of the variable binding stack (also known as specpdl) to 5000. This limits how deeply functions and macros can nest in their use of local variables, helping prevent infinite recursion or excessively deep nesting from consuming all available memory.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set garbage collection threshold to 100000000</span>
(<span style="font-weight: bold;">setq</span> gc-cons-threshold 100000000)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set maximum depth of the variable binding stack (specpdl) to 5000</span>
(<span style="font-weight: bold;">setq</span> max-specpdl-size 5000)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1890927" class="outline-2">
<h2 id="org1890927">Personal Information</h2>
<div class="outline-text-2" id="text-org1890927">
<p>
The provided block of code is used to set user-specific information in Emacs. It sets the <b>user-full-name</b> as "Anirban Chakraborty" and the <b>user-mail-address</b> as "achakraborty2591@gmail.com". This information can be utilized by various Emacs packages that require user details.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> user-full-name <span style="font-style: italic;">"Anirban Chakraborty"</span>)
(<span style="font-weight: bold;">setq</span> user-mail-address <span style="font-style: italic;">"achakraborty2591@gmail.com"</span>)
</pre>
</div>
</div>
</div>
