emacs_config.html

<div id="outline-container-orgfd14e25" class="outline-2">
<h2 id="orgfd14e25">Package Manager</h2>
<div class="outline-text-2" id="text-orgfd14e25">
</div>
<div id="outline-container-org42bfa01" class="outline-3">
<h3 id="org42bfa01">Elpaca Package Manager</h3>
<div class="outline-text-3" id="text-org42bfa01">
<p>
This Emacs Lisp code is configuring and using the elpaca package, a tool for managing Emacs packages. Firstly, it sets up several variables related to elpaca, including its version, directories for builds and repositories, and order of operations. Then, it checks if the elpaca repository exists in the specified directory. If not, it creates the directory and clones the elpaca repository from GitHub. It also compiles the cloned files and generates autoloads for them. After that, it adds a hook to process queues after initialization and installs support for the use-package macro with elpaca. The script then waits until the current queue has been processed before proceeding. This can be useful when installing a package which modifies a form used at the top-level. Finally, there are examples of how to use elpaca with use-package, including turning off elpaca-use-package-mode for immediate interpretation of declarations (useful for built-in Emacs features), and deferring execution of body commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">elpaca-installer-version</span> 0.5)
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">elpaca-directory</span> (expand-file-name <span style="font-style: italic;">"elpaca/"</span> user-emacs-directory))
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">elpaca-builds-directory</span> (expand-file-name <span style="font-style: italic;">"builds/"</span> elpaca-directory))
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">elpaca-repos-directory</span> (expand-file-name <span style="font-style: italic;">"repos/"</span> elpaca-directory))
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">elpaca-order</span> '(elpaca <span style="font-weight: bold;">:repo</span> <span style="font-style: italic;">"https://github.com/progfolio/elpaca.git"</span>
                              <span style="font-weight: bold;">:ref</span> nil
                              <span style="font-weight: bold;">:files</span> (<span style="font-weight: bold;">:defaults</span> (<span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"extensions"</span>))
                              <span style="font-weight: bold;">:build</span> (<span style="font-weight: bold;">:not</span> elpaca--activate-package)))

(<span style="font-weight: bold;">let*</span> ((repo  (expand-file-name <span style="font-style: italic;">"elpaca/"</span> elpaca-repos-directory))
       (build (expand-file-name <span style="font-style: italic;">"elpaca/"</span> elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (<span style="font-weight: bold;">if</span> (file-exists-p build) build repo))
  (<span style="font-weight: bold;">unless</span> (file-exists-p repo)
    (make-directory repo t)
    (<span style="font-weight: bold;">when</span> (&lt; emacs-major-version 28) 
      (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">subr-x</span>))
    (<span style="font-weight: bold;">condition-case-unless-debug</span> err
        (<span style="font-weight: bold;">if-let</span> ((buffer (pop-to-buffer-same-window <span style="font-style: italic;">"*elpaca-bootstrap*"</span>))
                 ((zerop (call-process <span style="font-style: italic;">"git"</span> nil buffer t <span style="font-style: italic;">"clone"</span>
                                       (plist-get order <span style="font-weight: bold;">:repo</span>) repo)))
                 ((zerop (call-process <span style="font-style: italic;">"git"</span> nil buffer t <span style="font-style: italic;">"checkout"</span>
                                       (<span style="font-weight: bold;">or</span> (plist-get order <span style="font-weight: bold;">:ref</span>) <span style="font-style: italic;">"--"</span>))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil <span style="font-style: italic;">"-Q"</span> <span style="font-style: italic;">"-L"</span> <span style="font-style: italic;">"."</span> <span style="font-style: italic;">"--batch"</span>
                                       <span style="font-style: italic;">"--eval"</span> <span style="font-style: italic;">"(byte-recompile-directory \".\" 0 'force)"</span>)))
                 ((<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">elpaca</span>))
                 ((elpaca-generate-autoloads <span style="font-style: italic;">"elpaca"</span> repo)))
            (<span style="font-weight: bold;">progn</span> 
              (message <span style="font-style: italic;">"%s"</span> (buffer-string)) 
              (kill-buffer buffer))
          (<span style="font-weight: bold;">error</span> <span style="font-style: italic;">"%s"</span> (<span style="font-weight: bold;">with-current-buffer</span> buffer (buffer-string))))
      ((<span style="font-weight: bold;">error</span>) 
       (<span style="font-weight: bold;">warn</span> <span style="font-style: italic;">"%s"</span> err) 
       (delete-directory repo 'recursive))))
  (<span style="font-weight: bold;">unless</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">elpaca-autoloads</span> nil t)
    (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">elpaca</span>)
    (elpaca-generate-autoloads <span style="font-style: italic;">"elpaca"</span> repo)
    (load <span style="font-style: italic;">"./elpaca-autoloads"</span>)))

(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Install use-package support</span>
(elpaca elpaca-use-package
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable :elpaca use-package keyword.</span>
  (elpaca-use-package-mode)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Assume :elpaca t unless otherwise specified.</span>
  (<span style="font-weight: bold;">setq</span> elpaca-use-package-by-default t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Block until current queue processed.</span>
(elpaca-wait)

<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">When installing a package which modifies a form used at the top-level</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(e.g. a package which adds a use-package key word),</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">use `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">elpaca-wait</span><span style="font-weight: bold; font-style: italic;">' to block until that package has been installed/configured.</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">For example:</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(use-package general :demand t)</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(elpaca-wait)</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Expands to: (elpaca evil (use-package evil :demand t))</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(use-package evil :demand t)</span>

<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">Turns off elpaca-use-package-mode current declartion</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">Note this will cause the declaration to be interpreted immediately (not deferred).</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">Useful for configuring built-in emacs features.</span>
(use-package emacs <span style="font-weight: bold;">:elpaca</span> nil <span style="font-weight: bold;">:config</span> (<span style="font-weight: bold;">setq</span> ring-bell-function #'ignore))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't install anything. Defer execution of BODY</span>
(elpaca nil (message <span style="font-style: italic;">"deferred"</span>))

</pre>
</div>
</div>
</div>
