emacs_config.html

<div id="outline-container-org69f9bed" class="outline-3">
<h3 id="org69f9bed">Automatic Package Update</h3>
<div class="outline-text-3" id="text-org69f9bed">
<p>
The Emacs Lisp code is set up to configure the auto-package-update package via the use-package macro. The directive :ensure t guarantees that the auto-package-update package will be installed if it isn't already. In the :custom section, three behaviors are established: old versions of packages will be deleted post-update, update results buffer won't be displayed after updates, and users will receive a prompt before updates are executed. Lastly, in the :config section, the function auto-package-update-maybe is invoked which checks for package updates at startup but seeks user confirmation before proceeding with them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package auto-package-update
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:custom</span>
  (auto-package-update-delete-old-versions t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Delete old versions of packages after update</span>
  (auto-package-update-hide-results t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't show the update results buffer after updates</span>
  (auto-package-update-prompt-before-update t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Prompt before performing updates</span>
  <span style="font-weight: bold;">:config</span>
  (auto-package-update-maybe))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Run auto-package-update at startup, but ask user before doing so</span>

</pre>
</div>
</div>
</div>
</div>
