skeleton_files/emacs_config.org
* Startup

The Emacs Lisp code configures various settings for Emacs to improve usability and efficiency. It inhibits the startup message, makes the initial scratch buffer empty, requires a final newline in files, disables automatic backups, auto-save, and lockfile creation while placing backup files in a temporary directory. The UI/UX is configured with elements like visible bell, tab width, scroll behavior, double-space after periods, tooltips, toolbar, scrollbar, fringe mode, menu bar, etc. UTF-8 is set as the preferred coding system. Show-paren-mode and electric-pair-mode are enabled, but electric-indent-mode is disabled. Selected text can be replaced when typing or pasting. Line-number-mode and column-number-mode are activated. Current line highlighting is applied in programming or text modes. Other global settings include URL highlighting/linkifying, automatic file change detection, line number display, truncated lines, subword navigation, and syntax highlighting. Keybindings are also set for quitting, increasing/decreasing text scale with both keyboard and mouse wheel.

#+BEGIN_SRC emacs-lisp

;; Startup settings
(setq inhibit-startup-message t)  ;; Inhibit the startup Emacs message
(setq initial-scratch-message nil)  ;; Make the initial scratch buffer empty

;; File handling settings
(setq require-final-newline t)  ;; Require a final newline in files
(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq tramp-backup-directory-alist backup-directory-alist)  ;; Put backup files in a temporary directory
(setq make-backup-files nil)
(setq auto-save-default nil)
(setq create-lockfiles nil)

;; UI/UX settings
(setq visible-bell t) ;; Set up the visible bell
(setq tab-width 4)
(setq indent-tabs-mode nil)
(setq scroll-conservatively 0) ;; Reduce scroll-conservatively
(setq mouse-drag-copy-region nil)
(setq sentence-end-double-space nil)  ;; No Double-spaces after periods
(setq truncate-string-ellipsis "…") ;; Unicode ellipses are better
(setq completions-detailed t) ;; More info in completions
(setq next-error-message-highlight t) ;; Highlight error messages more aggressively
(when (window-system)
      (tool-bar-mode -1)  ;; Disable the toolbar
      (scroll-bar-mode -1)  ;; Disable visible scrollbar
      (tooltip-mode -1) ;; Disable tooltips
      (pixel-scroll-mode))
(when (eq system-type 'darwin)
      (setq ns-auto-hide-menu-bar nil))
(set-fringe-mode 10)  ;; Give some breathing room
(menu-bar-mode 1) ;; Enable the menu bar

;; Encoding settings
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8-unix)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(set-charset-priority 'unicode)

;; Parentheses and indentation settings
(show-paren-mode)
(setq show-paren-style 'mixed)
(electric-pair-mode 1)
(electric-indent-mode -1)   ;; Turn off the weird indenting that Emacs does by default

;; Selection settings
(delete-selection-mode 1) ;; Enable replacing the selected text when typing/pasting

;; Line and column numbers settings
(column-number-mode)
(line-number-mode)

;; Highlight current line in programming or text modes
(require 'hl-line)
(add-hook 'prog-mode-hook #'hl-line-mode)
(add-hook 'text-mode-hook #'hl-line-mode)

;; Other global settings
(global-goto-address-mode)  ;; URLs should be highlighted and linkified
(global-auto-revert-mode t) ;; Automatically show changes if the file has changed
(global-display-line-numbers-mode t)  ;; Display line numbers
(global-visual-line-mode t) ;; Enable truncated lines
(global-subword-mode) ;; Enable navigating through subwords when text is in camel case
(global-font-lock-mode t) ;; Enables font-lock (aka syntax highlighting) globally

;; Keybindings
(global-set-key [escape] 'keyboard-escape-quit)
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)

#+END_SRC

