emacs_config.html

<div id="outline-container-orgcc51c69" class="outline-2">
<h2 id="orgcc51c69">Startup</h2>
<div class="outline-text-2" id="text-orgcc51c69">
<p>
The Emacs Lisp code configures various settings for Emacs to improve usability and efficiency. It inhibits the startup message, makes the initial scratch buffer empty, requires a final newline in files, disables automatic backups, auto-save, and lockfile creation while placing backup files in a temporary directory. The UI/UX is configured with elements like visible bell, tab width, scroll behavior, double-space after periods, tooltips, toolbar, scrollbar, fringe mode, menu bar, etc. UTF-8 is set as the preferred coding system. Show-paren-mode and electric-pair-mode are enabled, but electric-indent-mode is disabled. Selected text can be replaced when typing or pasting. Line-number-mode and column-number-mode are activated. Current line highlighting is applied in programming or text modes. Other global settings include URL highlighting/linkifying, automatic file change detection, line number display, truncated lines, subword navigation, and syntax highlighting. Keybindings are also set for quitting, increasing/decreasing text scale with both keyboard and mouse wheel.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Startup settings</span>
(<span style="font-weight: bold;">setq</span> inhibit-startup-message t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Inhibit the startup Emacs message</span>
(<span style="font-weight: bold;">setq</span> initial-scratch-message nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Make the initial scratch buffer empty</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">File handling settings</span>
(<span style="font-weight: bold;">setq</span> require-final-newline t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Require a final newline in files</span>
(<span style="font-weight: bold;">setq</span> backup-directory-alist `((<span style="font-style: italic;">".*"</span> . ,temporary-file-directory)))
(<span style="font-weight: bold;">setq</span> tramp-backup-directory-alist backup-directory-alist)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Put backup files in a temporary directory</span>
(<span style="font-weight: bold;">setq</span> make-backup-files nil)
(<span style="font-weight: bold;">setq</span> auto-save-default nil)
(<span style="font-weight: bold;">setq</span> create-lockfiles nil)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">UI/UX settings</span>
(<span style="font-weight: bold;">setq</span> visible-bell t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set up the visible bell</span>
(<span style="font-weight: bold;">setq</span> tab-width 4)
(<span style="font-weight: bold;">setq</span> indent-tabs-mode nil)
(<span style="font-weight: bold;">setq</span> scroll-conservatively 0) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Reduce scroll-conservatively</span>
(<span style="font-weight: bold;">setq</span> mouse-drag-copy-region nil)
(<span style="font-weight: bold;">setq</span> sentence-end-double-space nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">No Double-spaces after periods</span>
(<span style="font-weight: bold;">setq</span> truncate-string-ellipsis <span style="font-style: italic;">"&#8230;"</span>) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Unicode ellipses are better</span>
(<span style="font-weight: bold;">setq</span> completions-detailed t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">More info in completions</span>
(<span style="font-weight: bold;">setq</span> next-error-message-highlight t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Highlight error messages more aggressively</span>
(<span style="font-weight: bold;">when</span> (window-system)
      (tool-bar-mode -1)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable the toolbar</span>
      (scroll-bar-mode -1)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable visible scrollbar</span>
      (tooltip-mode -1) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable tooltips</span>
      (pixel-scroll-mode))
(<span style="font-weight: bold;">when</span> (eq system-type 'darwin)
      (<span style="font-weight: bold;">setq</span> ns-auto-hide-menu-bar nil))
(set-fringe-mode 10)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Give some breathing room</span>
(menu-bar-mode 1) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable the menu bar</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Encoding settings</span>
(<span style="font-weight: bold;">setq</span> locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8-unix)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(set-charset-priority 'unicode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Parentheses and indentation settings</span>
(show-paren-mode)
(<span style="font-weight: bold;">setq</span> show-paren-style 'mixed)
(electric-pair-mode 1)
(electric-indent-mode -1)   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Turn off the weird indenting that Emacs does by default</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Selection settings</span>
(delete-selection-mode 1) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable replacing the selected text when typing/pasting</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Line and column numbers settings</span>
(column-number-mode)
(line-number-mode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Highlight current line in programming or text modes</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">hl-line</span>)
(add-hook 'prog-mode-hook #'hl-line-mode)
(add-hook 'text-mode-hook #'hl-line-mode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Other global settings</span>
(global-goto-address-mode)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">URLs should be highlighted and linkified</span>
(global-auto-revert-mode t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Automatically show changes if the file has changed</span>
(global-display-line-numbers-mode t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Display line numbers</span>
(global-visual-line-mode t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable truncated lines</span>
(global-subword-mode) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable navigating through subwords when text is in camel case</span>
(global-font-lock-mode t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enables font-lock (aka syntax highlighting) globally</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Keybindings</span>
(global-set-key [escape] 'keyboard-escape-quit)
(global-set-key (kbd <span style="font-style: italic;">"C-="</span>) 'text-scale-increase)
(global-set-key (kbd <span style="font-style: italic;">"C--"</span>) 'text-scale-decrease)
(global-set-key (kbd <span style="font-style: italic;">"&lt;C-wheel-up&gt;"</span>) 'text-scale-increase)
(global-set-key (kbd <span style="font-style: italic;">"&lt;C-wheel-down&gt;"</span>) 'text-scale-decrease)

</pre>
</div>
</div>
</div>
