skeleton_files/emacs_config.org
* Auto-Save

The Emacs Lisp code configures the auto-save feature in Emacs to enhance file safety and data integrity. It sets the location of auto-save files to the system's temporary directory by transforming all auto-save file names and setting the prefix for auto-save list files. The auto-saving interval is set to every 1000 characters typed, while the timeout for auto-saving is set to every 120 seconds of idle time. Furthermore, a function named save-buffer-if-visiting-file is defined that saves the current buffer only if it is visiting a file and has been modified. This function is added to the auto-save-hook, enabling it to run whenever an auto-save is triggered by Emacs.

#+BEGIN_SRC emacs-lisp

;; Auto-save settings
(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t))) ;; Transform the auto-save file name to use temporary directory
(setq auto-save-list-file-prefix temporary-file-directory) ;; Set prefix for auto-save list files to be in the temporary directory
(setq auto-save-interval 1000) ;; Set interval of auto-saving to every 1000 characters typed
(setq auto-save-timeout 120) ;; Set timeout of auto-saving to every 120 seconds idle time

;; Function to save buffer if it's visiting a file
(defun save-buffer-if-visiting-file (&optional args)
  "Save the current buffer only if it is visiting a file"
  (interactive)
  (if (and (buffer-file-name) (buffer-modified-p))
      (save-buffer args)))

;; Add function to auto-save hook
(add-hook 'auto-save-hook #'save-buffer-if-visiting-file)

#+END_SRC

* Appearance 

** OS X Specific Settings

The Emacs Lisp code configures the exec-path-from-shell package, which is used to import environment variables like $PATH from the shell. It ensures that this package is installed and passes the -l argument to the shell. Additionally, it sets up macOS-specific settings: when Emacs runs in a window system instead of a terminal, it sets the initial frame dimensions to 160 units wide and 50 units tall. Optional configurations for starting fullscreen and setting the default font size are also provided. Line spacing is set at 0.12, and comments and keywords can be displayed in italic, although this feature is optional as it may not look good with certain fonts.

#+BEGIN_SRC emacs-lisp

;; Use exec-path-from-shell package to get environment variables such as $PATH from the shell
(use-package exec-path-from-shell
  :ensure t  ;; Ensure the package is installed if not present
  :custom
  (exec-path-from-shell-arguments '("-l")))  ;; Pass "-l" argument to the shell

;; macOS specific settings
(when (eq system-type 'darwin)
  (when (window-system)
    ;; Startup Window Dimension
    (setq initial-frame-alist '((width . 160) (height . 50))) 

    ;; Uncomment below line to start fullscreen
    ;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

    ;; Set default font size (optional)
    (set-face-attribute 'default nil :font "Fira Code-16")
    (set-face-attribute 'default nil :height 160)

    ;; Set line spacing
    (setq-default line-spacing 0.12)

    ;; Make comments and keywords italic.
    ;; This can look bad in some fonts.
    (set-face-attribute 'font-lock-comment-face nil :slant 'italic)
    (set-face-attribute 'font-lock-keyword-face nil :slant 'italic)))

#+END_SRC

