emacs_config.html

<div id="outline-container-org3630839" class="outline-2">
<h2 id="org3630839">Auto-Save</h2>
<div class="outline-text-2" id="text-org3630839">
<p>
The Emacs Lisp code configures the auto-save feature in Emacs to enhance file safety and data integrity. It sets the location of auto-save files to the system's temporary directory by transforming all auto-save file names and setting the prefix for auto-save list files. The auto-saving interval is set to every 1000 characters typed, while the timeout for auto-saving is set to every 120 seconds of idle time. Furthermore, a function named save-buffer-if-visiting-file is defined that saves the current buffer only if it is visiting a file and has been modified. This function is added to the auto-save-hook, enabling it to run whenever an auto-save is triggered by Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Auto-save settings</span>
(<span style="font-weight: bold;">setq</span> auto-save-file-name-transforms `((<span style="font-style: italic;">".*"</span> ,temporary-file-directory t))) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Transform the auto-save file name to use temporary directory</span>
(<span style="font-weight: bold;">setq</span> auto-save-list-file-prefix temporary-file-directory) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set prefix for auto-save list files to be in the temporary directory</span>
(<span style="font-weight: bold;">setq</span> auto-save-interval 1000) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set interval of auto-saving to every 1000 characters typed</span>
(<span style="font-weight: bold;">setq</span> auto-save-timeout 120) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set timeout of auto-saving to every 120 seconds idle time</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Function to save buffer if it's visiting a file</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">save-buffer-if-visiting-file</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> args)
  <span style="font-style: italic;">"Save the current buffer only if it is visiting a file"</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">and</span> (buffer-file-name) (buffer-modified-p))
      (save-buffer args)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add function to auto-save hook</span>
(add-hook 'auto-save-hook #'save-buffer-if-visiting-file)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdcc512" class="outline-2">
<h2 id="orgfdcc512">Appearance</h2>
<div class="outline-text-2" id="text-orgfdcc512">
</div>
<div id="outline-container-org8ab8f0b" class="outline-3">
<h3 id="org8ab8f0b">OS X Specific Settings</h3>
<div class="outline-text-3" id="text-org8ab8f0b">
<p>
The Emacs Lisp code configures the exec-path-from-shell package, which is used to import environment variables like $PATH from the shell. It ensures that this package is installed and passes the -l argument to the shell. Additionally, it sets up macOS-specific settings: when Emacs runs in a window system instead of a terminal, it sets the initial frame dimensions to 160 units wide and 50 units tall. Optional configurations for starting fullscreen and setting the default font size are also provided. Line spacing is set at 0.12, and comments and keywords can be displayed in italic, although this feature is optional as it may not look good with certain fonts.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use exec-path-from-shell package to get environment variables such as $PATH from the shell</span>
(use-package exec-path-from-shell
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:custom</span>
  (exec-path-from-shell-arguments '(<span style="font-style: italic;">"-l"</span>)))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Pass "-l" argument to the shell</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">macOS specific settings</span>
(<span style="font-weight: bold;">when</span> (eq system-type 'darwin)
  (<span style="font-weight: bold;">when</span> (window-system)
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Startup Window Dimension</span>
    (<span style="font-weight: bold;">setq</span> initial-frame-alist '((width . 160) (height . 50))) 

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Uncomment below line to start fullscreen</span>
    <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(add-to-list 'default-frame-alist '(fullscreen . maximized))</span>

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set default font size (optional)</span>
    (set-face-attribute 'default nil <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"Fira Code-16"</span>)
    (set-face-attribute 'default nil <span style="font-weight: bold;">:height</span> 160)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set line spacing</span>
    (<span style="font-weight: bold;">setq-default</span> line-spacing 0.12)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Make comments and keywords italic.</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This can look bad in some fonts.</span>
    (set-face-attribute 'font-lock-comment-face nil <span style="font-weight: bold;">:slant</span> 'italic)
    (set-face-attribute 'font-lock-keyword-face nil <span style="font-weight: bold;">:slant</span> 'italic)))

</pre>
</div>
</div>
</div>
