skeleton_files/emacs_config.org
** Color Theme Settings

The Emacs Lisp code configures several packages related to themes, modeline, and syntax highlighting. The 'doom-themes' package provides a set of attractive color themes with configurations for bold and italic styles, visual bell, neotree, org, and an option to load the 'doom-one' theme. The 'auto-dark' package automatically switches between light and dark themes based on time of day, setting 'doom-bluloco-dark' as the dark theme and 'doom-bluloco-light' as the light theme while enabling auto-dark-mode. The 'doom-modeline' package customizes the modeline (status bar at the bottom of an Emacs window) by configuring its height, width, indentation info, word count, buffer file name style, state icon, modification icon, perspective name, perspective icon, modal icon, and time icon. The 'rainbow-delimiters' package makes matching parentheses stand out with differing colors depending on their depth and is activated in programming modes. Similarly, the 'rainbow-mode' package colorizes color names in buffers and activates in programming modes. Lastly, the 'highlight-indent-guides' package visually indicates indent levels with guide lines, activating in programming modes and using the 'character' method for displaying guides.

#+BEGIN_SRC emacs-lisp

;; Use doom-themes package for theme settings
(use-package doom-themes
  :ensure t
  :after all-the-icons
  :config
  (setq doom-themes-enable-bold t)
  (setq doom-themes-enable-italic t)
  ;;(load-theme 'doom-one t) ;; Uncomment to load the 'doom-one' theme
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-org-config))

;; Use auto-dark package for automatic dark mode
(use-package auto-dark
  :ensure t
  :config
  (setq auto-dark-dark-theme 'doom-bluloco-dark)
  (setq auto-dark-light-theme 'doom-bluloco-light)
  (auto-dark-mode 1))

;; Use doom-modeline package for modeline configuration
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode)
  :config
  (setq doom-modeline-height 40)
  (setq doom-modeline-bar-width 5)
  (setq doom-modeline-indent-info t)
  (setq doom-modeline-enable-word-count t)
  (setq doom-modeline-buffer-file-name-style 'relative-from-project)
  (setq doom-modeline-buffer-state-icon t)
  (setq doom-modeline-buffer-modification-icon t)
  (setq doom-modeline-persp-name t)
  (setq doom-modeline-persp-icon t)
  (setq doom-modeline-modal-icon t)
  (setq doom-modeline-icon t)
  (setq doom-modeline-time-icon t))

;; Use rainbow-delimiters package for colorful parentheses matching
(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

;; Use rainbow-mode package for colorizing color names in buffers
(use-package rainbow-mode
  :ensure t
  :diminish
  :hook
  (prog-mode . rainbow-mode))

;; Use highlight-indent-guides package for visualizing indent levels
(use-package highlight-indent-guides
  :ensure t
  :config
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
  (setq highlight-indent-guides-method 'character))

#+END_SRC

** Diminish Settings

This Emacs Lisp code configures the diminish package in Emacs. The diminish package is used to reduce or eliminate minor modes on the mode line, making it less cluttered. The :ensure t directive ensures that the package is installed if it's not already present.

#+BEGIN_SRC emacs-lisp

;; Use diminish package to reduce or eliminate minor modes on the mode line
(use-package diminish
  :ensure t) ;; Ensure the package is installed if not present

#+END_SRC

** Fancy Compilation Settings

This Emacs Lisp code configures the fancy-compilation package in Emacs. The fancy-compilation package is used to enhance the compilation buffer, providing a more visually appealing and informative display of compilation results. The :ensure t directive ensures that the package is installed if it's not already present, and fancy-compilation-mode is enabled in the :config section.

#+BEGIN_SRC emacs-lisp

;; Use fancy-compilation package to enhance the *compilation* buffer
(use-package fancy-compilation
  :ensure t  ;; Ensure the package is installed if not present
  :config
  (fancy-compilation-mode))  ;; Enable fancy-compilation mode

#+END_SRC

** Counsel Settings

This Emacs Lisp script is for loading and configuring the 'counsel' package. It ensures that the 'counsel' package is installed, if not it installs it. The script also reduces or eliminates minor mode lighter in the mode line. In its configuration options, it enables 'counsel' mode.

#+BEGIN_SRC emacs-lisp
 
;; Load the 'counsel' package
(use-package counsel
  :ensure t   ;; Ensure that the package is installed if not already
  :diminish   ;; Reduce or eliminate minor mode lighter in mode line
  :config     ;; Configuration options for 'counsel'
  (counsel-mode 1))  ;; Enable 'counsel' mode

#+END_SRC


