emacs_config.html

<div id="outline-container-org7a07a15" class="outline-3">
<h3 id="org7a07a15">Color Theme Settings</h3>
<div class="outline-text-3" id="text-org7a07a15">
<p>
The Emacs Lisp code configures several packages related to themes, modeline, and syntax highlighting. The 'doom-themes' package provides a set of attractive color themes with configurations for bold and italic styles, visual bell, neotree, org, and an option to load the 'doom-one' theme. The 'auto-dark' package automatically switches between light and dark themes based on time of day, setting 'doom-bluloco-dark' as the dark theme and 'doom-bluloco-light' as the light theme while enabling auto-dark-mode. The 'doom-modeline' package customizes the modeline (status bar at the bottom of an Emacs window) by configuring its height, width, indentation info, word count, buffer file name style, state icon, modification icon, perspective name, perspective icon, modal icon, and time icon. The 'rainbow-delimiters' package makes matching parentheses stand out with differing colors depending on their depth and is activated in programming modes. Similarly, the 'rainbow-mode' package colorizes color names in buffers and activates in programming modes. Lastly, the 'highlight-indent-guides' package visually indicates indent levels with guide lines, activating in programming modes and using the 'character' method for displaying guides.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use doom-themes package for theme settings</span>
(use-package doom-themes
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> all-the-icons
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> doom-themes-enable-bold t)
  (<span style="font-weight: bold;">setq</span> doom-themes-enable-italic t)
  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(load-theme 'doom-one t) ;; Uncomment to load the 'doom-one' theme</span>
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-org-config))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use auto-dark package for automatic dark mode</span>
(use-package auto-dark
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> auto-dark-dark-theme 'doom-bluloco-dark)
  (<span style="font-weight: bold;">setq</span> auto-dark-light-theme 'doom-bluloco-light)
  (auto-dark-mode 1))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use doom-modeline package for modeline configuration</span>
(use-package doom-modeline
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (doom-modeline-mode)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> doom-modeline-height 40)
  (<span style="font-weight: bold;">setq</span> doom-modeline-bar-width 5)
  (<span style="font-weight: bold;">setq</span> doom-modeline-indent-info t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-enable-word-count t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-buffer-file-name-style 'relative-from-project)
  (<span style="font-weight: bold;">setq</span> doom-modeline-buffer-state-icon t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-buffer-modification-icon t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-persp-name t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-persp-icon t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-modal-icon t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-icon t)
  (<span style="font-weight: bold;">setq</span> doom-modeline-time-icon t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use rainbow-delimiters package for colorful parentheses matching</span>
(use-package rainbow-delimiters
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use rainbow-mode package for colorizing color names in buffers</span>
(use-package rainbow-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:diminish</span>
  <span style="font-weight: bold;">:hook</span>
  (prog-mode . rainbow-mode))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use highlight-indent-guides package for visualizing indent levels</span>
(use-package highlight-indent-guides
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
  (<span style="font-weight: bold;">setq</span> highlight-indent-guides-method 'character))

</pre>
</div>
</div>
</div>

<div id="outline-container-org456a7da" class="outline-3">
<h3 id="org456a7da">Diminish Settings</h3>
<div class="outline-text-3" id="text-org456a7da">
<p>
This Emacs Lisp code configures the diminish package in Emacs. The diminish package is used to reduce or eliminate minor modes on the mode line, making it less cluttered. The :ensure t directive ensures that the package is installed if it's not already present.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use diminish package to reduce or eliminate minor modes on the mode line</span>
(use-package diminish
  <span style="font-weight: bold;">:ensure</span> t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org048d2c7" class="outline-3">
<h3 id="org048d2c7">Fancy Compilation Settings</h3>
<div class="outline-text-3" id="text-org048d2c7">
<p>
This Emacs Lisp code configures the fancy-compilation package in Emacs. The fancy-compilation package is used to enhance the compilation buffer, providing a more visually appealing and informative display of compilation results. The :ensure t directive ensures that the package is installed if it's not already present, and fancy-compilation-mode is enabled in the :config section.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use fancy-compilation package to enhance the *compilation* buffer</span>
(use-package fancy-compilation
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:config</span>
  (fancy-compilation-mode))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable fancy-compilation mode</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd889ed2" class="outline-3">
<h3 id="orgd889ed2">Counsel Settings</h3>
<div class="outline-text-3" id="text-orgd889ed2">
<p>
This Emacs Lisp script is for loading and configuring the 'counsel' package. It ensures that the 'counsel' package is installed, if not it installs it. The script also reduces or eliminates minor mode lighter in the mode line. In its configuration options, it enables 'counsel' mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load the 'counsel' package</span>
(use-package counsel
  <span style="font-weight: bold;">:ensure</span> t   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure that the package is installed if not already</span>
  <span style="font-weight: bold;">:diminish</span>   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Reduce or eliminate minor mode lighter in mode line</span>
  <span style="font-weight: bold;">:config</span>     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configuration options for 'counsel'</span>
  (counsel-mode 1))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable 'counsel' mode</span>

</pre>
</div>
</div>
</div>
