emacs_config.html


<div id="outline-container-orgc8789ec" class="outline-3">
<h3 id="orgc8789ec">Dired Settings</h3>
<div class="outline-text-3" id="text-orgc8789ec">
<p>
The Emacs Lisp code configures several packages to enhance the functionality and user experience of Dired, a directory browser in Emacs. The 'diredc' package enhances directory browsing by remapping dired-other-frame to diredc. The 'dired-open' package customizes how files are opened in Dired. The 'diredfl' package adds color to filenames for better differentiation and is configured to activate global mode. The 'dired-hacks-utils' package provides additional utilities for Dired. The 'dired-filter' package enables file filtering in Dired and activates filter mode. The 'dired-hide-dotfiles' package hides dotfiles in Dired and is hooked to activate hide-dotfiles-mode when dired-mode is enabled. The 'dired-rainbow' package colorizes filenames based on their type or extension with detailed color configurations. Lastly, the 'eim-peep-dired' package allows for previewing files in Dired with specific cleanup settings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use diredc package for enhanced directory browsing</span>
(use-package diredc
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (global-set-key [remap dired-other-frame] 'diredc))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use dired-open package to customize file opening in Dired</span>
(use-package dired-open
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use diredfl package for colorful file names in Dired</span>
(use-package diredfl
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (diredfl-global-mode t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use dired-hacks-utils package for additional utilities for Dired</span>
(use-package dired-hacks-utils
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use dired-filter package for filtering files in Dired</span>
(use-package dired-filter
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (dired-filter-mode t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use dired-hide-dotfiles package to hide dotfiles in Dired</span>
(use-package dired-hide-dotfiles
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span>
  (dired-mode . dired-hide-dotfiles-mode))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use dired-rainbow package for colorizing file names based on their type or extension</span>
(use-package dired-rainbow
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define custom colors for different file types</span>
  (<span style="font-weight: bold;">progn</span>
    (dired-rainbow-define-chmod directory <span style="font-style: italic;">"#6cb2eb"</span> <span style="font-style: italic;">"d.*"</span>)
    (dired-rainbow-define html <span style="font-style: italic;">"#eb5286"</span> (<span style="font-style: italic;">"css"</span> <span style="font-style: italic;">"less"</span> <span style="font-style: italic;">"sass"</span> <span style="font-style: italic;">"scss"</span> <span style="font-style: italic;">"htm"</span> <span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"jhtm"</span> <span style="font-style: italic;">"mht"</span> <span style="font-style: italic;">"eml"</span> <span style="font-style: italic;">"mustache"</span> <span style="font-style: italic;">"xhtml"</span>))
    (dired-rainbow-define xml <span style="font-style: italic;">"#f2d024"</span> (<span style="font-style: italic;">"xml"</span> <span style="font-style: italic;">"xsd"</span> <span style="font-style: italic;">"xsl"</span> <span style="font-style: italic;">"xslt"</span> <span style="font-style: italic;">"wsdl"</span> <span style="font-style: italic;">"bib"</span> <span style="font-style: italic;">"json"</span> <span style="font-style: italic;">"msg"</span> <span style="font-style: italic;">"pgn"</span> <span style="font-style: italic;">"rss"</span> <span style="font-style: italic;">"yaml"</span> <span style="font-style: italic;">"yml"</span> <span style="font-style: italic;">"rdata"</span>))
    (dired-rainbow-define document <span style="font-style: italic;">"#9561e2"</span> (<span style="font-style: italic;">"docm"</span> <span style="font-style: italic;">"doc"</span> <span style="font-style: italic;">"docx"</span> <span style="font-style: italic;">"odb"</span> <span style="font-style: italic;">"odt"</span> <span style="font-style: italic;">"pdb"</span> <span style="font-style: italic;">"pdf"</span> <span style="font-style: italic;">"ps"</span> <span style="font-style: italic;">"rtf"</span> <span style="font-style: italic;">"djvu"</span> <span style="font-style: italic;">"epub"</span> <span style="font-style: italic;">"odp"</span> <span style="font-style: italic;">"ppt"</span> <span style="font-style: italic;">"pptx"</span>))
    (dired-rainbow-define markdown <span style="font-style: italic;">"#ffed4a"</span> (<span style="font-style: italic;">"org"</span> <span style="font-style: italic;">"etx"</span> <span style="font-style: italic;">"info"</span> <span style="font-style: italic;">"markdown"</span> <span style="font-style: italic;">"md"</span> <span style="font-style: italic;">"mkd"</span> <span style="font-style: italic;">"nfo"</span> <span style="font-style: italic;">"pod"</span> <span style="font-style: italic;">"rst"</span> <span style="font-style: italic;">"tex"</span> <span style="font-style: italic;">"textfile"</span> <span style="font-style: italic;">"txt"</span>))
    (dired-rainbow-define database <span style="font-style: italic;">"#6574cd"</span> (<span style="font-style: italic;">"xlsx"</span> <span style="font-style: italic;">"xls"</span> <span style="font-style: italic;">"csv"</span> <span style="font-style: italic;">"accdb"</span> <span style="font-style: italic;">"db"</span> <span style="font-style: italic;">"mdb"</span> <span style="font-style: italic;">"sqlite"</span> <span style="font-style: italic;">"nc"</span>))
    (dired-rainbow-define media <span style="font-style: italic;">"#de751f"</span> (<span style="font-style: italic;">"mp3"</span> <span style="font-style: italic;">"mp4"</span> <span style="font-style: italic;">"MP3"</span> <span style="font-style: italic;">"MP4"</span> <span style="font-style: italic;">"avi"</span> <span style="font-style: italic;">"mpeg"</span> <span style="font-style: italic;">"mpg"</span> <span style="font-style: italic;">"flv"</span> <span style="font-style: italic;">"ogg"</span> <span style="font-style: italic;">"mov"</span> <span style="font-style: italic;">"mid"</span> <span style="font-style: italic;">"midi"</span> <span style="font-style: italic;">"wav"</span> <span style="font-style: italic;">"aiff"</span> <span style="font-style: italic;">"flac"</span>))
    (dired-rainbow-define image <span style="font-style: italic;">"#f66d9b"</span> (<span style="font-style: italic;">"tiff"</span> <span style="font-style: italic;">"tif"</span> <span style="font-style: italic;">"cdr"</span> <span style="font-style: italic;">"gif"</span> <span style="font-style: italic;">"ico"</span> <span style="font-style: italic;">"jpeg"</span> <span style="font-style: italic;">"jpg"</span> <span style="font-style: italic;">"png"</span> <span style="font-style: italic;">"psd"</span> <span style="font-style: italic;">"eps"</span> <span style="font-style: italic;">"svg"</span>))
    (dired-rainbow-define log <span style="font-style: italic;">"#c17d11"</span> (<span style="font-style: italic;">"log"</span>))
    (dired-rainbow-define shell <span style="font-style: italic;">"#f6993f"</span> (<span style="font-style: italic;">"awk"</span> <span style="font-style: italic;">"bash"</span> <span style="font-style: italic;">"bat"</span> <span style="font-style: italic;">"sed"</span> <span style="font-style: italic;">"sh"</span> <span style="font-style: italic;">"zsh"</span> <span style="font-style: italic;">"vim"</span>))
    (dired-rainbow-define interpreted <span style="font-style: italic;">"#38c172"</span> (<span style="font-style: italic;">"py"</span> <span style="font-style: italic;">"ipynb"</span> <span style="font-style: italic;">"rb"</span> <span style="font-style: italic;">"pl"</span> <span style="font-style: italic;">"t"</span> <span style="font-style: italic;">"msql"</span> <span style="font-style: italic;">"mysql"</span> <span style="font-style: italic;">"pgsql"</span> <span style="font-style: italic;">"sql"</span> <span style="font-style: italic;">"r"</span> <span style="font-style: italic;">"clj"</span> <span style="font-style: italic;">"cljs"</span> <span style="font-style: italic;">"scala"</span> <span style="font-style: italic;">"js"</span>))
    (dired-rainbow-define compiled <span style="font-style: italic;">"#4dc0b5"</span> (<span style="font-style: italic;">"asm"</span> <span style="font-style: italic;">"cl"</span> <span style="font-style: italic;">"lisp"</span> <span style="font-style: italic;">"el"</span> <span style="font-style: italic;">"c"</span> <span style="font-style: italic;">"h"</span> <span style="font-style: italic;">"c++"</span> <span style="font-style: italic;">"h++"</span> <span style="font-style: italic;">"hpp"</span> <span style="font-style: italic;">"hxx"</span> <span style="font-style: italic;">"m"</span> <span style="font-style: italic;">"cc"</span> <span style="font-style: italic;">"cs"</span> <span style="font-style: italic;">"cp"</span> <span style="font-style: italic;">"cpp"</span> <span style="font-style: italic;">"go"</span> <span style="font-style: italic;">"f"</span> <span style="font-style: italic;">"for"</span> <span style="font-style: italic;">"ftn"</span> <span style="font-style: italic;">"f90"</span> <span style="font-style: italic;">"f95"</span> <span style="font-style: italic;">"f03"</span> <span style="font-style: italic;">"f08"</span> <span style="font-style: italic;">"s"</span> <span style="font-style: italic;">"rs"</span> <span style="font-style: italic;">"hi"</span> <span style="font-style: italic;">"hs"</span> <span style="font-style: italic;">"pyc"</span> <span style="font-style: italic;">".java"</span>))
    (dired-rainbow-define executable <span style="font-style: italic;">"#8cc4ff"</span> (<span style="font-style: italic;">"exe"</span> <span style="font-style: italic;">"msi"</span>))
    (dired-rainbow-define compressed <span style="font-style: italic;">"#51d88a"</span> (<span style="font-style: italic;">"7z"</span> <span style="font-style: italic;">"zip"</span> <span style="font-style: italic;">"bz2"</span> <span style="font-style: italic;">"tgz"</span> <span style="font-style: italic;">"txz"</span> <span style="font-style: italic;">"gz"</span> <span style="font-style: italic;">"xz"</span> <span style="font-style: italic;">"z"</span> <span style="font-style: italic;">"Z"</span> <span style="font-style: italic;">"jar"</span> <span style="font-style: italic;">"war"</span> <span style="font-style: italic;">"ear"</span> <span style="font-style: italic;">"rar"</span> <span style="font-style: italic;">"sar"</span> <span style="font-style: italic;">"xpi"</span> <span style="font-style: italic;">"apk"</span> <span style="font-style: italic;">"xz"</span> <span style="font-style: italic;">"tar"</span>))
    (dired-rainbow-define packaged <span style="font-style: italic;">"#faad63"</span> (<span style="font-style: italic;">"deb"</span> <span style="font-style: italic;">"rpm"</span> <span style="font-style: italic;">"apk"</span> <span style="font-style: italic;">"jad"</span> <span style="font-style: italic;">"jar"</span> <span style="font-style: italic;">"cab"</span> <span style="font-style: italic;">"pak"</span> <span style="font-style: italic;">"pk3"</span> <span style="font-style: italic;">"vdf"</span> <span style="font-style: italic;">"vpk"</span> <span style="font-style: italic;">"bsp"</span>))
    (dired-rainbow-define encrypted <span style="font-style: italic;">"#ffed4a"</span> (<span style="font-style: italic;">"gpg"</span> <span style="font-style: italic;">"pgp"</span> <span style="font-style: italic;">"asc"</span> <span style="font-style: italic;">"bfe"</span> <span style="font-style: italic;">"enc"</span> <span style="font-style: italic;">"signature"</span> <span style="font-style: italic;">"sig"</span> <span style="font-style: italic;">"p12"</span> <span style="font-style: italic;">"pem"</span>))
    (dired-rainbow-define fonts <span style="font-style: italic;">"#6cb2eb"</span> (<span style="font-style: italic;">"afm"</span> <span style="font-style: italic;">"fon"</span> <span style="font-style: italic;">"fnt"</span> <span style="font-style: italic;">"pfb"</span> <span style="font-style: italic;">"pfm"</span> <span style="font-style: italic;">"ttf"</span> <span style="font-style: italic;">"otf"</span>))
    (dired-rainbow-define partition <span style="font-style: italic;">"#e3342f"</span> (<span style="font-style: italic;">"dmg"</span> <span style="font-style: italic;">"iso"</span> <span style="font-style: italic;">"bin"</span> <span style="font-style: italic;">"nrg"</span> <span style="font-style: italic;">"qcow"</span> <span style="font-style: italic;">"toast"</span> <span style="font-style: italic;">"vcd"</span> <span style="font-style: italic;">"vmdk"</span> <span style="font-style: italic;">"bak"</span>))
    (dired-rainbow-define vc <span style="font-style: italic;">"#0074d9"</span> (<span style="font-style: italic;">"git"</span> <span style="font-style: italic;">"gitignore"</span> <span style="font-style: italic;">"gitattributes"</span> <span style="font-style: italic;">"gitmodules"</span>))
    (dired-rainbow-define-chmod executable-unix <span style="font-style: italic;">"#38c172"</span> <span style="font-style: italic;">"-.*x.*"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use eim-peep-dired package for previewing files in Dired</span>
(use-package eim-peep-dired
  <span style="font-weight: bold;">:defer</span> t <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">don't access `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired-mode-map</span><span style="font-weight: bold; font-style: italic;">' until `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">eim-peep-dired</span><span style="font-weight: bold; font-style: italic;">' is loaded</span>
  <span style="font-weight: bold;">:elpaca</span> (<span style="font-weight: bold;">:host</span> github <span style="font-weight: bold;">:repo</span> <span style="font-style: italic;">"mac230/eim-peep-dired"</span>)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> eim-peep-dired-cleanup-eagerly nil)
  (<span style="font-weight: bold;">setq</span> eim-peep-dired-cleanup-on-disable t))

</pre>
</div>
</div>
</div>
