skeleton_files/emacs_config.org
** Help Settings

This Emacs Lisp script is for loading and configuring the 'helpful' package, which provides enhanced help buffers in Emacs. The script ensures that the 'helpful' package is installed if it's not already present. It defines commands provided by the package such as helpful-callable, helpful-variable, helpful-command, and helpful-key. In its custom configuration options, it sets counsel's describe function to use helpful-callable and counsel's describe variable to use helpful-variable.

#+BEGIN_SRC emacs-lisp

;; Use helpful package for enhanced help buffers in Emacs
(use-package helpful
  :ensure t  ;; Ensure the package is installed if not present
  :commands (helpful-callable helpful-variable helpful-command helpful-key)  ;; Define commands provided by the package
  :custom
  (counsel-describe-function-function #'helpful-callable)  ;; Set counsel's describe function to use helpful-callable
  (counsel-describe-variable-function #'helpful-variable))  ;; Set counsel's describe variable to use helpful-variable

#+END_SRC

** Neotree Settings

This Emacs Lisp script is for loading and configuring the 'neotree' package, which provides a tree-like file explorer in Emacs. The script ensures that the 'neotree' package is installed if it's not already present. In its configuration options, it enables smart open feature, shows hidden files, sets the width of NeoTree window, does not fix the size of NeoTree window, sets the theme based on whether display supports graphics or not, prevents font cache compacting, and sets an action when switching projects with Projectile. It also includes a hook to truncate long file names in neotree.

| COMMAND        | DESCRIPTION                   | KEYBINDING |
|----------------+-------------------------------+------------|
| neotree-toggle | /Toggle neotree/                | SPC t n    |
| neotree- dir   | /Open directory in neotree/     | SPC d n    |

#+BEGIN_SRC emacs-lisp

;; Use neotree package for tree-like file explorer
(use-package neotree
  :ensure t  ;; Ensure the package is installed if not present
  :config
  (setq neo-smart-open t)  ;; Enable smart open feature
  (setq neo-show-hidden-files t)  ;; Show hidden files
  (setq neo-window-width 55)  ;; Set width of NeoTree window
  (setq neo-window-fixed-size nil)  ;; Do not fix size of NeoTree window
  (setq neo-theme (if (display-graphic-p) 'icons 'arrow))  ;; Set theme based on whether display supports graphics or not
  (setq inhibit-compacting-font-caches t)  ;; Prevent font cache compacting
  (setq projectile-switch-project-action 'neotree-projectile-action)  ;; Set action when switching projects with Projectile
  
  ;; Truncate long file names in neotree
  (add-hook 'neo-after-create-hook
            #'(lambda (_)
                (with-current-buffer (get-buffer neo-buffer-name)
                  (setq truncate-lines t)
                  (setq word-wrap nil)
                  (make-local-variable 'auto-hscroll-mode)
                  (setq auto-hscroll-mode nil)))))

#+END_SRC

