emacs_config.html

<div id="outline-container-org4292a79" class="outline-3">
<h3 id="org4292a79">Help Settings</h3>
<div class="outline-text-3" id="text-org4292a79">
<p>
This Emacs Lisp script is for loading and configuring the 'helpful' package, which provides enhanced help buffers in Emacs. The script ensures that the 'helpful' package is installed if it's not already present. It defines commands provided by the package such as helpful-callable, helpful-variable, helpful-command, and helpful-key. In its custom configuration options, it sets counsel's describe function to use helpful-callable and counsel's describe variable to use helpful-variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use helpful package for enhanced help buffers in Emacs</span>
(use-package helpful
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:commands</span> (helpful-callable helpful-variable helpful-command helpful-key)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define commands provided by the package</span>
  <span style="font-weight: bold;">:custom</span>
  (counsel-describe-function-function #'helpful-callable)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set counsel's describe function to use helpful-callable</span>
  (counsel-describe-variable-function #'helpful-variable))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set counsel's describe variable to use helpful-variable</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org23c0bb5" class="outline-3">
<h3 id="org23c0bb5">Neotree Settings</h3>
<div class="outline-text-3" id="text-org23c0bb5">
<p>
This Emacs Lisp script is for loading and configuring the 'neotree' package, which provides a tree-like file explorer in Emacs. The script ensures that the 'neotree' package is installed if it's not already present. In its configuration options, it enables smart open feature, shows hidden files, sets the width of NeoTree window, does not fix the size of NeoTree window, sets the theme based on whether display supports graphics or not, prevents font cache compacting, and sets an action when switching projects with Projectile. It also includes a hook to truncate long file names in neotree.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">COMMAND</th>
<th scope="col" class="org-left">DESCRIPTION</th>
<th scope="col" class="org-left">KEYBINDING</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">neotree-toggle</td>
<td class="org-left"><i>Toggle neotree</i></td>
<td class="org-left">SPC t n</td>
</tr>

<tr>
<td class="org-left">neotree- dir</td>
<td class="org-left"><i>Open directory in neotree</i></td>
<td class="org-left">SPC d n</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use neotree package for tree-like file explorer</span>
(use-package neotree
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> neo-smart-open t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable smart open feature</span>
  (<span style="font-weight: bold;">setq</span> neo-show-hidden-files t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Show hidden files</span>
  (<span style="font-weight: bold;">setq</span> neo-window-width 55)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set width of NeoTree window</span>
  (<span style="font-weight: bold;">setq</span> neo-window-fixed-size nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not fix size of NeoTree window</span>
  (<span style="font-weight: bold;">setq</span> neo-theme (<span style="font-weight: bold;">if</span> (display-graphic-p) 'icons 'arrow))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set theme based on whether display supports graphics or not</span>
  (<span style="font-weight: bold;">setq</span> inhibit-compacting-font-caches t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Prevent font cache compacting</span>
  (<span style="font-weight: bold;">setq</span> projectile-switch-project-action 'neotree-projectile-action)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set action when switching projects with Projectile</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Truncate long file names in neotree</span>
  (add-hook 'neo-after-create-hook
            #'(lambda (_)
                (<span style="font-weight: bold;">with-current-buffer</span> (get-buffer neo-buffer-name)
                  (<span style="font-weight: bold;">setq</span> truncate-lines t)
                  (<span style="font-weight: bold;">setq</span> word-wrap nil)
                  (make-local-variable 'auto-hscroll-mode)
                  (<span style="font-weight: bold;">setq</span> auto-hscroll-mode nil)))))

</pre>
</div>
</div>
</div>
