skeleton_files/emacs_config.org
** Icon Settings

The Emacs Lisp script loads and configures several packages that provide icon support in Emacs. The 'nerd-icons' package provides icons with the font family set to "Symbols Nerd Font Mono". The 'nerd-icons-dired' package displays icons in Dired mode, enabling nerd-icons-dired-mode in dired-mode. The 'treemacs-nerd-icons' package shows icons in Treemacs by loading the nerd-icons theme. The 'nerd-icons-ibuffer' package displays icons in Ibuffer mode, enabling nerd-icons-ibuffer-mode in ibuffer-mode with various configurations. The 'nerd-icons-completion' package offers icon completion by enabling nerd-icons-completion-mode. The 'all-the-icons' package provides icons in Emacs, only loading if display supports graphics and installs fonts if not present. The 'all-the-icons-dired' package displays icons in Dired mode, enabling all-the-icons-dired-mode in dired-mode without using monochrome icons. Lastly, the 'all-the-icons-completion' package provides icon completion by enabling all-the-icons-completion-mode and setting up marginalia with all-the-icons.

#+BEGIN_SRC emacs-lisp

;; Use nerd-icons package for icons in Emacs
(use-package nerd-icons
  :ensure t  ;; Ensure the package is installed if not present
  :custom
  (nerd-icons-font-family "Symbols Nerd Font Mono"))  ;; Set font family for nerd-icons

;; Use nerd-icons-dired package to display icons in Dired mode
(use-package nerd-icons-dired
  :ensure t
  :hook (dired-mode . nerd-icons-dired-mode))  ;; Enable nerd-icons-dired-mode in dired-mode

;; Use treemacs-nerd-icons package to display icons in Treemacs
(use-package treemacs-nerd-icons
  :ensure t
  :config
  (treemacs-load-theme "nerd-icons"))  ;; Load nerd-icons theme for Treemacs

;; Use nerd-icons-ibuffer package to display icons in Ibuffer mode
(use-package nerd-icons-ibuffer
  :ensure t
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode)  ;; Enable nerd-icons-ibuffer-mode in ibuffer-mode
  :config
  (setq nerd-icons-ibuffer-icon t)
  (setq nerd-icons-ibuffer-color-icon t)
  (setq nerd-icons-ibuffer-human-readable-size t))

;; Use nerd-icons-completion package for icon completion
(use-package nerd-icons-completion
  :ensure t
  :config
  (nerd-icons-completion-mode))  ;; Enable nerd-icons-completion-mode
  
;; Use all-the-icons package for icons in Emacs
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p)  ;; Only load if display supports graphics
  :config
  (unless (find-font (font-spec :family "all-the-icons"))  ;; Install fonts if not present
    (all-the-icons-install-fonts t)))

;; Use all-the-icons-dired package to display icons in Dired mode
(use-package all-the-icons-dired
  :ensure t
  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)  ;; Enable all-the-icons-dired-mode in dired-mode
  (setq all-the-icons-dired-monochrome nil))  ;; Do not use monochrome icons
  
;; Use all-the-icons-completion package for icon completion
(use-package all-the-icons-completion
  :ensure t
  :config
  (all-the-icons-completion-mode)  ;; Enable all-the-icons-completion-mode
  (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup))  ;; Setup marginalia with all-the-icons

#+END_SRC

