emacs_config.html

<div id="outline-container-org8ef9be8" class="outline-3">
<h3 id="org8ef9be8">Icon Settings</h3>
<div class="outline-text-3" id="text-org8ef9be8">
<p>
The Emacs Lisp script loads and configures several packages that provide icon support in Emacs. The 'nerd-icons' package provides icons with the font family set to "Symbols Nerd Font Mono". The 'nerd-icons-dired' package displays icons in Dired mode, enabling nerd-icons-dired-mode in dired-mode. The 'treemacs-nerd-icons' package shows icons in Treemacs by loading the nerd-icons theme. The 'nerd-icons-ibuffer' package displays icons in Ibuffer mode, enabling nerd-icons-ibuffer-mode in ibuffer-mode with various configurations. The 'nerd-icons-completion' package offers icon completion by enabling nerd-icons-completion-mode. The 'all-the-icons' package provides icons in Emacs, only loading if display supports graphics and installs fonts if not present. The 'all-the-icons-dired' package displays icons in Dired mode, enabling all-the-icons-dired-mode in dired-mode without using monochrome icons. Lastly, the 'all-the-icons-completion' package provides icon completion by enabling all-the-icons-completion-mode and setting up marginalia with all-the-icons.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use nerd-icons package for icons in Emacs</span>
(use-package nerd-icons
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:custom</span>
  (nerd-icons-font-family <span style="font-style: italic;">"Symbols Nerd Font Mono"</span>))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set font family for nerd-icons</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use nerd-icons-dired package to display icons in Dired mode</span>
(use-package nerd-icons-dired
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (dired-mode . nerd-icons-dired-mode))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable nerd-icons-dired-mode in dired-mode</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use treemacs-nerd-icons package to display icons in Treemacs</span>
(use-package treemacs-nerd-icons
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (treemacs-load-theme <span style="font-style: italic;">"nerd-icons"</span>))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load nerd-icons theme for Treemacs</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use nerd-icons-ibuffer package to display icons in Ibuffer mode</span>
(use-package nerd-icons-ibuffer
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (ibuffer-mode . nerd-icons-ibuffer-mode)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable nerd-icons-ibuffer-mode in ibuffer-mode</span>
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> nerd-icons-ibuffer-icon t)
  (<span style="font-weight: bold;">setq</span> nerd-icons-ibuffer-color-icon t)
  (<span style="font-weight: bold;">setq</span> nerd-icons-ibuffer-human-readable-size t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use nerd-icons-completion package for icon completion</span>
(use-package nerd-icons-completion
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (nerd-icons-completion-mode))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable nerd-icons-completion-mode</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use all-the-icons package for icons in Emacs</span>
(use-package all-the-icons
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:if</span> (display-graphic-p)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Only load if display supports graphics</span>
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">unless</span> (find-font (font-spec <span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"all-the-icons"</span>))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Install fonts if not present</span>
    (all-the-icons-install-fonts t)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use all-the-icons-dired package to display icons in Dired mode</span>
(use-package all-the-icons-dired
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable all-the-icons-dired-mode in dired-mode</span>
  (<span style="font-weight: bold;">setq</span> all-the-icons-dired-monochrome nil))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not use monochrome icons</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use all-the-icons-completion package for icon completion</span>
(use-package all-the-icons-completion
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (all-the-icons-completion-mode)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable all-the-icons-completion-mode</span>
  (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setup marginalia with all-the-icons</span>

</pre>
</div>
</div>
</div>
