skeleton_files/emacs_config.org
** Dashboard Settings

The Emacs Lisp script loads and configures several packages that enhance the startup screen, project management, and workspace management in Emacs. The 'dashboard' package provides a pleasant startup screen by setting the initial buffer to be the dashboard, enabling heading and file icons, setting banner title, centering content, specifying items to show on the dashboard, modifying heading icons, and setting up the dashboard at startup. The 'projectile' package is used for project management and is configured to enable Projectile mode. The 'perspective' package is used for workspace management; it suppresses prefix key warning, sets prefix key for Perspective mode, enables Perspective mode, turns on mode string, and sets a file to write to when states are saved. It also groups buffers by persp-name in ibuffer and automatically saves perspective states to file when Emacs exits.

#+BEGIN_SRC emacs-lisp

;; Use dashboard package for a nice startup screen
(use-package dashboard
  :ensure t  ;; Ensure the package is installed if not present
  :init
  (setq initial-buffer-choice 'dashboard-open)  ;; Set initial buffer to be the dashboard
  (setq dashboard-set-heading-icons t)  ;; Enable heading icons
  (setq dashboard-set-file-icons t)  ;; Enable file icons
  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")  ;; Set banner title
  ;;(setq dashboard-startup-banner 'logo) ;; Uncomment to use standard emacs logo as banner
  (setq dashboard-center-content t)  ;; Center content
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))  ;; Set items to show in dashboard
  :custom 
  (dashboard-modify-heading-icons '((recents . "file-text") (bookmarks . "book")))  ;; Modify heading icons
  :config
  (dashboard-setup-startup-hook))  ;; Setup dashboard at startup
  
;; Use projectile package for project management
(use-package projectile
  :ensure t
  :config
  (projectile-mode))  ;; Enable Projectile mode
  
;; Use perspective package for workspace management
(use-package perspective
  :ensure t
  :custom
  (persp-suppress-no-prefix-key-warning t)  ;; Suppress prefix key warning
  (persp-mode-prefix-key (kbd "C-c M-p"))  ;; Set prefix key for Perspective mode
  :config
  (persp-mode)  ;; Enable Perspective mode
  (persp-turn-on-modestring)  ;; Turn on mode string
  ;; Sets a file to write to when we save states
  (setq persp-state-default-file "~/.emacs.d/sessions"))

;; This will group buffers by persp-name in ibuffer.
(add-hook 'ibuffer-hook
  (lambda ()
    (persp-ibuffer-set-filter-groups)
    (unless (eq ibuffer-sorting-mode 'alphabetic)
      (ibuffer-do-sort-by-alphabetic))))

;; Automatically save perspective states to file when Emacs exits.
(add-hook 'kill-emacs-hook #'persp-state-save)

#+END_SRC

** Which Key Settings

This Emacs Lisp script is for loading and configuring the 'which-key' package, which displays available keybindings in a popup. The script ensures that the 'which-key' package is installed if it's not already present. It enables 'which-key' mode and sets various configuration options such as the location of the which-key window, sorting order of keys, column padding, minimum display lines, side window slot, maximum height of the side window, idle delay before the which-key popup appears, maximum description length, and separator string.

#+BEGIN_SRC emacs-lisp

;; Use which-key package to display available keybindings in popup
(use-package which-key
  :ensure t  ;; Ensure the package is installed if not present
  :init
  (which-key-mode 1)  ;; Enable which-key mode
  :diminish
  :config
  (setq which-key-side-window-location 'bottom)  ;; Set location of which-key window
  (setq which-key-sort-order #'which-key-key-order-alpha)  ;; Sort keys alphabetically
  (setq which-key-allow-imprecise-window-fit nil)  ;; Do not allow imprecise window fit
  (setq which-key-sort-uppercase-first nil)  ;; Do not sort uppercase keys first
  (setq which-key-add-column-padding 1)  ;; Add column padding
  (setq which-key-max-display-columns nil)  ;; Do not limit max display columns
  (setq which-key-min-display-lines 6)  ;; Set min display lines
  (setq which-key-side-window-slot -10)  ;; Set side window slot
  (setq which-key-side-window-max-height 0.25)  ;; Set max height of side window
  (setq which-key-idle-delay 0.8)  ;; Set idle delay before which-key popup appears
  (setq which-key-max-description-length 25)  ;; Set max description length
  (setq which-key-separator " → "))  ;; Set separator string

#+END_SRC

* Keybindings

