emacs_config.html

<div id="outline-container-orgc0c2ada" class="outline-3">
<h3 id="orgc0c2ada">Dashboard Settings</h3>
<div class="outline-text-3" id="text-orgc0c2ada">
<p>
The Emacs Lisp script loads and configures several packages that enhance the startup screen, project management, and workspace management in Emacs. The 'dashboard' package provides a pleasant startup screen by setting the initial buffer to be the dashboard, enabling heading and file icons, setting banner title, centering content, specifying items to show on the dashboard, modifying heading icons, and setting up the dashboard at startup. The 'projectile' package is used for project management and is configured to enable Projectile mode. The 'perspective' package is used for workspace management; it suppresses prefix key warning, sets prefix key for Perspective mode, enables Perspective mode, turns on mode string, and sets a file to write to when states are saved. It also groups buffers by persp-name in ibuffer and automatically saves perspective states to file when Emacs exits.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use dashboard package for a nice startup screen</span>
(use-package dashboard
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> initial-buffer-choice 'dashboard-open)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set initial buffer to be the dashboard</span>
  (<span style="font-weight: bold;">setq</span> dashboard-set-heading-icons t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable heading icons</span>
  (<span style="font-weight: bold;">setq</span> dashboard-set-file-icons t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable file icons</span>
  (<span style="font-weight: bold;">setq</span> dashboard-banner-logo-title <span style="font-style: italic;">"Emacs Is More Than A Text Editor!"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set banner title</span>
  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(setq dashboard-startup-banner 'logo) ;; Uncomment to use standard emacs logo as banner</span>
  (<span style="font-weight: bold;">setq</span> dashboard-center-content t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Center content</span>
  (<span style="font-weight: bold;">setq</span> dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set items to show in dashboard</span>
  <span style="font-weight: bold;">:custom</span> 
  (dashboard-modify-heading-icons '((recents . <span style="font-style: italic;">"file-text"</span>) (bookmarks . <span style="font-style: italic;">"book"</span>)))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Modify heading icons</span>
  <span style="font-weight: bold;">:config</span>
  (dashboard-setup-startup-hook))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setup dashboard at startup</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use projectile package for project management</span>
(use-package projectile
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (projectile-mode))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable Projectile mode</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use perspective package for workspace management</span>
(use-package perspective
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:custom</span>
  (persp-suppress-no-prefix-key-warning t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Suppress prefix key warning</span>
  (persp-mode-prefix-key (kbd <span style="font-style: italic;">"C-c M-p"</span>))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set prefix key for Perspective mode</span>
  <span style="font-weight: bold;">:config</span>
  (persp-mode)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable Perspective mode</span>
  (persp-turn-on-modestring)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Turn on mode string</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Sets a file to write to when we save states</span>
  (<span style="font-weight: bold;">setq</span> persp-state-default-file <span style="font-style: italic;">"~/.emacs.d/sessions"</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This will group buffers by persp-name in ibuffer.</span>
(add-hook 'ibuffer-hook
  (<span style="font-weight: bold;">lambda</span> ()
    (persp-ibuffer-set-filter-groups)
    (<span style="font-weight: bold;">unless</span> (eq ibuffer-sorting-mode 'alphabetic)
      (ibuffer-do-sort-by-alphabetic))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Automatically save perspective states to file when Emacs exits.</span>
(add-hook 'kill-emacs-hook #'persp-state-save)

</pre>
</div>
</div>
</div>

<div id="outline-container-orge2658a1" class="outline-3">
<h3 id="orge2658a1">Which Key Settings</h3>
<div class="outline-text-3" id="text-orge2658a1">
<p>
This Emacs Lisp script is for loading and configuring the 'which-key' package, which displays available keybindings in a popup. The script ensures that the 'which-key' package is installed if it's not already present. It enables 'which-key' mode and sets various configuration options such as the location of the which-key window, sorting order of keys, column padding, minimum display lines, side window slot, maximum height of the side window, idle delay before the which-key popup appears, maximum description length, and separator string.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use which-key package to display available keybindings in popup</span>
(use-package which-key
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:init</span>
  (which-key-mode 1)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable which-key mode</span>
  <span style="font-weight: bold;">:diminish</span>
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> which-key-side-window-location 'bottom)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set location of which-key window</span>
  (<span style="font-weight: bold;">setq</span> which-key-sort-order #'which-key-key-order-alpha)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Sort keys alphabetically</span>
  (<span style="font-weight: bold;">setq</span> which-key-allow-imprecise-window-fit nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not allow imprecise window fit</span>
  (<span style="font-weight: bold;">setq</span> which-key-sort-uppercase-first nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not sort uppercase keys first</span>
  (<span style="font-weight: bold;">setq</span> which-key-add-column-padding 1)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add column padding</span>
  (<span style="font-weight: bold;">setq</span> which-key-max-display-columns nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not limit max display columns</span>
  (<span style="font-weight: bold;">setq</span> which-key-min-display-lines 6)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set min display lines</span>
  (<span style="font-weight: bold;">setq</span> which-key-side-window-slot -10)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set side window slot</span>
  (<span style="font-weight: bold;">setq</span> which-key-side-window-max-height 0.25)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set max height of side window</span>
  (<span style="font-weight: bold;">setq</span> which-key-idle-delay 0.8)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set idle delay before which-key popup appears</span>
  (<span style="font-weight: bold;">setq</span> which-key-max-description-length 25)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set max description length</span>
  (<span style="font-weight: bold;">setq</span> which-key-separator <span style="font-style: italic;">" &#8594; "</span>))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set separator string</span>

</pre>
</div>
</div>
</div>
</div>
