skeleton_files/emacs_config.org
** Evil Mode Settings

The Emacs Lisp script loads and configures several packages that provide Vim emulation, additional keybindings, better undo/redo functionality, LaTeX support, surround functionality, and commenting/uncommenting lines in Emacs. The 'evil' package provides Vim emulation with configurations for not loading default keybindings, setting the undo system to 'undo-fu', enabling Evil mode, and setting initial states of messages buffer and dashboard to normal. The 'evil-collection' package offers additional Evil keybindings, loaded after Evil, adds help mode to the evil collection list, and initializes evil-collection. The 'undo-fu' package enhances undo/redo functionality. The 'evil-tex' package provides LaTeX support in Evil, loaded after AUCTeX and Evil, and enables evil-tex mode in LaTeX mode. The 'evil-surround' package provides surround functionality in Evil by enabling global Evil Surround mode. The 'evil-nerd-commenter' package allows for commenting/uncommenting lines in Evil by binding M-/ to comment or uncomment lines. Additionally, keys are unmapped in 'evil-maps so that Org mode's link following works correctly.

#+BEGIN_SRC emacs-lisp

;; Use evil package for Vim emulation in Emacs
(use-package evil
  :ensure t  ;; Ensure the package is installed if not present
  :init
  (setq evil-want-keybinding nil)  ;; Do not load default keybindings
  (setq evil-undo-system 'undo-redo)  ;; Adds vim-like C-r redo functionality
  (setq evil-undo-system 'undo-fu)  ;; Set undo system to undo-fu
  :config
  (evil-mode 1)  ;; Enable Evil mode
  (evil-set-initial-state 'messages-buffer-mode 'normal)  ;; Set initial state of messages buffer to normal
  (evil-set-initial-state 'dashboard-mode 'normal))  ;; Set initial state of dashboard to normal
  
;; Use evil-collection package for additional Evil keybindings
(use-package evil-collection
  :ensure t
  :after evil  ;; Load after Evil
  :config
  (add-to-list 'evil-collection-mode-list 'help)  ;; Add help mode to evil collection list
  (evil-collection-init))  ;; Initialize evil-collection

;; Use undo-fu package for better undo/redo functionality
(use-package undo-fu
  :ensure t)

;; Unmap keys in 'evil-maps so that Org mode's link following works correctly
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))

;; Use evil-tex package for LaTeX support in Evil
(use-package evil-tex
  :ensure t
  :after auctex  ;; Load after AUCTeX
  :after evil  ;; Load after Evil
  :config
  (add-hook 'LaTeX-mode-hook #'evil-tex-mode))  ;; Enable evil-tex mode in LaTeX mode

;; Use evil-surround package for surround functionality in Evil
(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))  ;; Enable global Evil Surround mode

;; Use evil-nerd-commenter package for commenting/uncommenting lines in Evil
(use-package evil-nerd-commenter
  :ensure t
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))  ;; Bind M-/ to comment or uncomment lines

#+END_SRC

