emacs_config.html

<div id="outline-container-org1e4451e" class="outline-2">
<h2 id="org1e4451e">Keybindings</h2>
<div class="outline-text-2" id="text-org1e4451e">
</div>
<div id="outline-container-org6f22dd0" class="outline-3">
<h3 id="org6f22dd0">Evil Mode Settings</h3>
<div class="outline-text-3" id="text-org6f22dd0">
<p>
The Emacs Lisp script loads and configures several packages that provide Vim emulation, additional keybindings, better undo/redo functionality, LaTeX support, surround functionality, and commenting/uncommenting lines in Emacs. The 'evil' package provides Vim emulation with configurations for not loading default keybindings, setting the undo system to 'undo-fu', enabling Evil mode, and setting initial states of messages buffer and dashboard to normal. The 'evil-collection' package offers additional Evil keybindings, loaded after Evil, adds help mode to the evil collection list, and initializes evil-collection. The 'undo-fu' package enhances undo/redo functionality. The 'evil-tex' package provides LaTeX support in Evil, loaded after AUCTeX and Evil, and enables evil-tex mode in LaTeX mode. The 'evil-surround' package provides surround functionality in Evil by enabling global Evil Surround mode. The 'evil-nerd-commenter' package allows for commenting/uncommenting lines in Evil by binding M-/ to comment or uncomment lines. Additionally, keys are unmapped in 'evil-maps so that Org mode's link following works correctly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use evil package for Vim emulation in Emacs</span>
(use-package evil
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> evil-want-keybinding nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not load default keybindings</span>
  (<span style="font-weight: bold;">setq</span> evil-undo-system 'undo-redo)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Adds vim-like C-r redo functionality</span>
  (<span style="font-weight: bold;">setq</span> evil-undo-system 'undo-fu)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set undo system to undo-fu</span>
  <span style="font-weight: bold;">:config</span>
  (evil-mode 1)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable Evil mode</span>
  (evil-set-initial-state 'messages-buffer-mode 'normal)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set initial state of messages buffer to normal</span>
  (evil-set-initial-state 'dashboard-mode 'normal))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set initial state of dashboard to normal</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use evil-collection package for additional Evil keybindings</span>
(use-package evil-collection
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> evil  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load after Evil</span>
  <span style="font-weight: bold;">:config</span>
  (add-to-list 'evil-collection-mode-list 'help)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add help mode to evil collection list</span>
  (evil-collection-init))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize evil-collection</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use undo-fu package for better undo/redo functionality</span>
(use-package undo-fu
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Unmap keys in 'evil-maps so that Org mode's link following works correctly</span>
(<span style="font-weight: bold;">with-eval-after-load</span> 'evil-maps
  (define-key evil-motion-state-map (kbd <span style="font-style: italic;">"SPC"</span>) nil)
  (define-key evil-motion-state-map (kbd <span style="font-style: italic;">"RET"</span>) nil)
  (define-key evil-motion-state-map (kbd <span style="font-style: italic;">"TAB"</span>) nil))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use evil-tex package for LaTeX support in Evil</span>
(use-package evil-tex
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> auctex  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load after AUCTeX</span>
  <span style="font-weight: bold;">:after</span> evil  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load after Evil</span>
  <span style="font-weight: bold;">:config</span>
  (add-hook 'LaTeX-mode-hook #'evil-tex-mode))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable evil-tex mode in LaTeX mode</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use evil-surround package for surround functionality in Evil</span>
(use-package evil-surround
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (global-evil-surround-mode 1))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable global Evil Surround mode</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use evil-nerd-commenter package for commenting/uncommenting lines in Evil</span>
(use-package evil-nerd-commenter
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"M-/"</span> . evilnc-comment-or-uncomment-lines))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind M-/ to comment or uncomment lines</span>

</pre>
</div>
</div>
</div>
