emacs_config.html

<div id="outline-container-org7c573d4" class="outline-3">
<h3 id="org7c573d4">General Keybinding Settings</h3>
<div class="outline-text-3" id="text-org7c573d4">
<p>
This code block integrates and configures the '<b>general</b>' package, which provides a convenient way to define keybindings in Emacs. It sets up 'SPC' as the global leader key that can be used to trigger various commands.
</p>
<ul class="org-ul">
<li>The first set of bindings includes general commands like opening the command prompt with 'counsel-M-x', finding files, listing perspective keybindings, commenting lines, and more.</li>
<li>The second set of bindings is related to buffer and bookmark management. These include switching to a different buffer, creating an indirect buffer copy in a split or new window, deleting bookmarks, killing buffers, setting bookmarks, navigating between buffers, reloading buffers, renaming buffers, saving buffers, and saving current bookmarks to the bookmark file.</li>
<li>The third set of bindings is related to Dired, Emacs's built-in file manager. These include opening Dired, jumping to the current directory in Dired, opening a directory in Neotree (a tree explorer), and peeping into files in Dired without leaving the Dired buffer.</li>
<li>The fourth set of bindings is for evaluating Elisp expressions and interacting with Eshell. These include evaluating the entire buffer or defun at point, evaluating an arbitrary expression, viewing Eshell history, reloading the current page in EWW (Emacs Web Wowser), and more.</li>
<li>The fifth set of bindings is for file management. These include opening specific configuration files, searching for strings in files or the current file, jumping to a file below the current directory, locating a file, finding recent files, editing files as root, and more.</li>
<li>The sixth set of bindings is related to Git operations via Magit, a Git interface for Emacs. These include dispatching Magit commands, checking out branches, creating commits and fixup commits, cloning repositories, showing commits, finding files in the repository, fetching updates from the remote repository, viewing the status of the repository, initializing new repositories, logging buffer changes, reverting files, staging and unstaging files, and traveling back in time with git-timemachine.</li>
<li>The seventh set of bindings provides quick access to various help and documentation resources in Emacs. These include displaying apropos information, describing bindings, characters, functions, faces, input methods, keys, language environments, modes, variables, and commands, viewing echo area messages, lossage (recent keystrokes and commands), GNU Project description, Info documents, and more. It also includes reloading the Emacs configuration file and loading themes.</li>
<li>The eighth set of bindings is related to Org mode, a powerful tool for note-taking and project management in Emacs. These include accessing the agenda view, exporting documents, toggling items, managing TODOs, tangling source code blocks, and more.</li>
<li>The ninth set of bindings provides commands for working with tables in Org mode, such as inserting horizontal lines.</li>
<li>The tenth set of bindings allows you to insert timestamps into your Org documents.</li>
<li>The eleventh set of bindings includes commands for opening various tools or views like the dashboard, new frames, and selecting frames by name.</li>
<li>The twelvth set of bindings gives access to Projectile's command map, which already has many useful keybindings defined for project navigation and manipulation.</li>
<li>The thirteenth set of bindings is for searching through dictionaries, man pages, TLDR docs, and woman pages.</li>
<li>The fifteenth set of bindings provides toggles for various modes and features like Eshell, Flycheck, line numbers display, Neotree file viewer, Org mode, Rainbow mode, truncated lines, and VTerm.</li>
<li>The last set of bindings is for window management. These include closing, creating, splitting windows horizontally or vertically, moving between windows, and moving buffers within windows.</li>
</ul>

<p>
These configurations aim to provide quick access to frequently used commands and enhance productivity by reducing the number of keystrokes needed for common tasks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use general package for convenient keybinding in Emacs</span>
(use-package general
  <span style="font-weight: bold;">:ensure</span> t  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure the package is installed if not present</span>
  <span style="font-weight: bold;">:config</span>
  (general-evil-setup)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setup general to work with Evil</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set up 'SPC' as the global leader key</span>
  (general-create-definer ACH/leader-keys
    <span style="font-weight: bold;">:states</span> '(normal insert visual emacs)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define states where these bindings are active</span>
    <span style="font-weight: bold;">:keymaps</span> 'override  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Override all other keymaps</span>
    <span style="font-weight: bold;">:prefix</span> <span style="font-style: italic;">"SPC"</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set leader key</span>
    <span style="font-weight: bold;">:global-prefix</span> <span style="font-style: italic;">"M-SPC"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Access leader key in insert mode</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"SPC"</span> '(counsel-M-x <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Counsel M-x"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind SPC SPC to counsel-M-x</span>
    <span style="font-style: italic;">"."</span> '(find-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Find file"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind . to find-file</span>
    <span style="font-style: italic;">"="</span> '(perspective-map <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Perspective"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Lists all the perspective keybindings</span>
    <span style="font-style: italic;">"TAB TAB"</span> '(comment-line <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Comment lines"</span>)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind TAB TAB to comment-line</span>
    <span style="font-style: italic;">"u"</span> '(universal-argument <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Universal argument"</span>))  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind u to universal-argument</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for bookmarks/buffers</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"b"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Bookmarks/Buffers"</span>)
    <span style="font-style: italic;">"b b"</span> '(switch-to-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Switch to buffer"</span>)
    <span style="font-style: italic;">"b c"</span> '(clone-indirect-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Create indirect buffer copy in a split"</span>)
    <span style="font-style: italic;">"b C"</span> '(clone-indirect-buffer-other-window <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Clone indirect buffer in new window"</span>)
    <span style="font-style: italic;">"b d"</span> '(bookmark-delete <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Delete bookmark"</span>)
    <span style="font-style: italic;">"b i"</span> '(ibuffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Ibuffer"</span>)
    <span style="font-style: italic;">"b k"</span> '(kill-current-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Kill current buffer"</span>)
    <span style="font-style: italic;">"b K"</span> '(kill-some-buffers <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Kill multiple buffers"</span>)
    <span style="font-style: italic;">"b l"</span> '(list-bookmarks <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"List bookmarks"</span>)
    <span style="font-style: italic;">"b m"</span> '(bookmark-set <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Set bookmark"</span>)
    <span style="font-style: italic;">"b n"</span> '(next-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Next buffer"</span>)
    <span style="font-style: italic;">"b p"</span> '(previous-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Previous buffer"</span>)
    <span style="font-style: italic;">"b r"</span> '(revert-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Reload buffer"</span>)
    <span style="font-style: italic;">"b R"</span> '(rename-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Rename buffer"</span>)
    <span style="font-style: italic;">"b s"</span> '(basic-save-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Save buffer"</span>)
    <span style="font-style: italic;">"b S"</span> '(save-some-buffers <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Save multiple buffers"</span>)
    <span style="font-style: italic;">"b w"</span> '(bookmark-save <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Save current bookmarks to bookmark file"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Dired</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"d"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Dired"</span>)
    <span style="font-style: italic;">"d d"</span> '(dired <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open dired"</span>)
    <span style="font-style: italic;">"d j"</span> '(dired-jump <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Dired jump to current"</span>)
    <span style="font-style: italic;">"d n"</span> '(neotree-dir <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open directory in neotree"</span>)
    <span style="font-style: italic;">"d p"</span> '(peep-dired <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Peep-dired"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Eshell/Evaluate</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"e"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Eshell/Evaluate"</span>)
    <span style="font-style: italic;">"e b"</span> '(eval-buffer <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Evaluate elisp in buffer"</span>)
    <span style="font-style: italic;">"e d"</span> '(eval-defun <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Evaluate defun containing or after point"</span>)
    <span style="font-style: italic;">"e e"</span> '(eval-expression <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Evaluate and elisp expression"</span>)
    <span style="font-style: italic;">"e h"</span> '(counsel-esh-history <span style="font-weight: bold;">:which-key</span> <span style="font-style: italic;">"Eshell history"</span>)
    <span style="font-style: italic;">"e l"</span> '(eval-last-sexp <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Evaluate elisp expression before point"</span>)
    <span style="font-style: italic;">"e r"</span> '(eval-region <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Evaluate elisp in region"</span>)
    <span style="font-style: italic;">"e R"</span> '(eww-reload <span style="font-weight: bold;">:which-key</span> <span style="font-style: italic;">"Reload current page in EWW"</span>)
    <span style="font-style: italic;">"e s"</span> '(eshell <span style="font-weight: bold;">:which-key</span> <span style="font-style: italic;">"Eshell"</span>)
    <span style="font-style: italic;">"e w"</span> '(eww <span style="font-weight: bold;">:which-key</span> <span style="font-style: italic;">"EWW emacs web browser"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for files</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"f"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Files"</span>)
    <span style="font-style: italic;">"f c"</span> '((<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>)
              (find-file <span style="font-style: italic;">"~/.emacs.d/emacs_config.org"</span>))
            <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open emacs emacs_config.org"</span>)
    <span style="font-style: italic;">"f e"</span> '((<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>)
              (dired <span style="font-style: italic;">"~/.emacs.d/"</span>))
            <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open user-emacs-directory in dired"</span>)
    <span style="font-style: italic;">"f d"</span> '(find-grep-dired <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Search for string in files in DIR"</span>)
    <span style="font-style: italic;">"f g"</span> '(counsel-grep-or-swiper <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Search for string current file"</span>)
    <span style="font-style: italic;">"f i"</span> '((<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>)
              (find-file <span style="font-style: italic;">"~/.emacs.d/init.el"</span>))
            <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open emacs init.el"</span>)
    <span style="font-style: italic;">"f j"</span> '(counsel-file-jump <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Jump to a file below current directory"</span>)
    <span style="font-style: italic;">"f l"</span> '(counsel-locate <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Locate a file"</span>)
    <span style="font-style: italic;">"f r"</span> '(counsel-recentf <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Find recent files"</span>)
    <span style="font-style: italic;">"f u"</span> '(sudo-edit-find-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Sudo find file"</span>)
    <span style="font-style: italic;">"f U"</span> '(sudo-edit <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Sudo edit file"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Git</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"g"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Git"</span>)
    <span style="font-style: italic;">"g /"</span> '(magit-displatch <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Magit dispatch"</span>)
    <span style="font-style: italic;">"g ."</span> '(magit-file-displatch <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Magit file dispatch"</span>)
    <span style="font-style: italic;">"g b"</span> '(magit-branch-checkout <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Switch branch"</span>)
    <span style="font-style: italic;">"g c"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Create"</span>)
    <span style="font-style: italic;">"g c b"</span> '(magit-branch-and-checkout <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Create branch and checkout"</span>)
    <span style="font-style: italic;">"g c c"</span> '(magit-commit-create <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Create commit"</span>)
    <span style="font-style: italic;">"g c f"</span> '(magit-commit-fixup <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Create fixup commit"</span>)
    <span style="font-style: italic;">"g C"</span> '(magit-clone <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Clone repo"</span>)
    <span style="font-style: italic;">"g f"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Find"</span>)
    <span style="font-style: italic;">"g f c"</span> '(magit-show-commit <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Show commit"</span>)
    <span style="font-style: italic;">"g f f"</span> '(magit-find-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Magit find file"</span>)
    <span style="font-style: italic;">"g f g"</span> '(magit-find-git-config-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Find gitconfig file"</span>)
    <span style="font-style: italic;">"g F"</span> '(magit-fetch <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Git fetch"</span>)
    <span style="font-style: italic;">"g g"</span> '(magit-status <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Magit status"</span>)
    <span style="font-style: italic;">"g i"</span> '(magit-init <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Initialize git repo"</span>)
    <span style="font-style: italic;">"g l"</span> '(magit-log-buffer-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Magit buffer log"</span>)
    <span style="font-style: italic;">"g r"</span> '(vc-revert <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Git revert file"</span>)
    <span style="font-style: italic;">"g s"</span> '(magit-stage-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Git stage file"</span>)
    <span style="font-style: italic;">"g t"</span> '(git-timemachine <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Git time machine"</span>)
    <span style="font-style: italic;">"g u"</span> '(magit-stage-file <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Git unstage file"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Help</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"h"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Help"</span>)
    <span style="font-style: italic;">"h a"</span> '(counsel-apropos <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Apropos"</span>)
    <span style="font-style: italic;">"h b"</span> '(describe-bindings <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe bindings"</span>)
    <span style="font-style: italic;">"h c"</span> '(describe-char <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe character under cursor"</span>)
    <span style="font-style: italic;">"h d"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Emacs documentation"</span>)
    <span style="font-style: italic;">"h d a"</span> '(about-emacs <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"About Emacs"</span>)
    <span style="font-style: italic;">"h d d"</span> '(view-emacs-debugging <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"View Emacs debugging"</span>)
    <span style="font-style: italic;">"h d f"</span> '(view-emacs-FAQ <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"View Emacs FAQ"</span>)
    <span style="font-style: italic;">"h d m"</span> '(info-emacs-manual <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"The Emacs manual"</span>)
    <span style="font-style: italic;">"h d n"</span> '(view-emacs-news <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"View Emacs news"</span>)
    <span style="font-style: italic;">"h d o"</span> '(describe-distribution <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"How to obtain Emacs"</span>)
    <span style="font-style: italic;">"h d p"</span> '(view-emacs-problems <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"View Emacs problems"</span>)
    <span style="font-style: italic;">"h d t"</span> '(view-emacs-todo <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"View Emacs todo"</span>)
    <span style="font-style: italic;">"h d w"</span> '(describe-no-warranty <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe no warranty"</span>)
    <span style="font-style: italic;">"h e"</span> '(view-echo-area-messages <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"View echo area messages"</span>)
    <span style="font-style: italic;">"h f"</span> '(describe-function <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe function"</span>)
    <span style="font-style: italic;">"h F"</span> '(describe-face <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe face"</span>)
    <span style="font-style: italic;">"h g"</span> '(describe-gnu-project <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe GNU Project"</span>)
    <span style="font-style: italic;">"h i"</span> '(info <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Info"</span>)
    <span style="font-style: italic;">"h I"</span> '(describe-input-method <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe input method"</span>)
    <span style="font-style: italic;">"h k"</span> '(describe-key <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe key"</span>)
    <span style="font-style: italic;">"h l"</span> '(view-lossage <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Display recent keystrokes and the commands run"</span>)
    <span style="font-style: italic;">"h L"</span> '(describe-language-environment <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe language environment"</span>)
    <span style="font-style: italic;">"h m"</span> '(describe-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe mode"</span>)
    <span style="font-style: italic;">"h r"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Reload"</span>)
    <span style="font-style: italic;">"h r r"</span> '((<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) (load-file <span style="font-style: italic;">"~/.emacs.d/init.el"</span>)) <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Reload emacs config"</span>)
    <span style="font-style: italic;">"h t"</span> '(load-theme <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Load theme"</span>)
    <span style="font-style: italic;">"h v"</span> '(describe-variable <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Describe variable"</span>)
    <span style="font-style: italic;">"h w"</span> '(where-is <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Prints keybinding for command if set"</span>)
    <span style="font-style: italic;">"h x"</span> '(describe-command <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Display full documentation for command"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Org mode</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"m"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org"</span>)
    <span style="font-style: italic;">"m a"</span> '(org-agenda <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org agenda"</span>)
    <span style="font-style: italic;">"m e"</span> '(org-export-dispatch <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org export dispatch"</span>)
    <span style="font-style: italic;">"m i"</span> '(org-toggle-item <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org toggle item"</span>)
    <span style="font-style: italic;">"m t"</span> '(org-todo <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org todo"</span>)
    <span style="font-style: italic;">"m B"</span> '(org-babel-tangle <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org babel tangle"</span>)
    <span style="font-style: italic;">"m T"</span> '(org-todo-list <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org todo list"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for NeoTree</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"n"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"NeoTree"</span>)
    <span style="font-style: italic;">"n r f"</span> '(neotree-refresh <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"NeoTree refresh"</span>)
    <span style="font-style: italic;">"n c e"</span> '(neotree-create-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"NeoTree create file/directory"</span>)
    <span style="font-style: italic;">"n d n"</span> '(neotree-delete-node <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"NeoTree delete current node"</span>)
    <span style="font-style: italic;">"n r n"</span> '(neotree-rename-node <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"NeoTree rename current node"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Tables in Org mode</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"m b"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Tables"</span>)
    <span style="font-style: italic;">"m b -"</span> '(org-table-insert-hline <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Insert hline in table"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Date/deadline in Org mode</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"m d"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Date/deadline"</span>)
    <span style="font-style: italic;">"m d t"</span> '(org-time-stamp <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Org time stamp"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Open</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"o"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open"</span>)
    <span style="font-style: italic;">"o d"</span> '(dashboard-open <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Dashboard"</span>)
    <span style="font-style: italic;">"o f"</span> '(make-frame <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Open buffer in new frame"</span>)
    <span style="font-style: italic;">"o F"</span> '(select-frame-by-name <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Select frame by name"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Projectile</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"p"</span> '(projectile-command-map <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Projectile"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Search</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"s"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Search"</span>)
    <span style="font-style: italic;">"s d"</span> '(dictionary-search <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Search dictionary"</span>)
    <span style="font-style: italic;">"s m"</span> '(man <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Man pages"</span>)
    <span style="font-style: italic;">"s t"</span> '(tldr <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Lookup TLDR docs for a command"</span>)
    <span style="font-style: italic;">"s w"</span> '(woman <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Similar to man but doesn't require man"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Toggle</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"t"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle"</span>)
    <span style="font-style: italic;">"t e"</span> '(eshell-toggle <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle eshell"</span>)
    <span style="font-style: italic;">"t f"</span> '(flycheck-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle flycheck"</span>)
    <span style="font-style: italic;">"t l"</span> '(display-line-numbers-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle line numbers"</span>)
    <span style="font-style: italic;">"t n"</span> '(neotree-toggle <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle neotree file viewer"</span>)
    <span style="font-style: italic;">"t o"</span> '(org-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle org mode"</span>)
    <span style="font-style: italic;">"t r"</span> '(rainbow-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle rainbow mode"</span>)
    <span style="font-style: italic;">"t t"</span> '(visual-line-mode <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle truncated lines"</span>)
    <span style="font-style: italic;">"t v"</span> '(vterm-toggle <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Toggle vterm"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define leader keybindings for Windows</span>
  (ACH/leader-keys
    <span style="font-style: italic;">"w"</span> '(<span style="font-weight: bold;">:ignore</span> t <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Windows"</span>)
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Window splits</span>
    <span style="font-style: italic;">"w c"</span> '(evil-window-delete <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Close window"</span>)
    <span style="font-style: italic;">"w n"</span> '(evil-window-new <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"New window"</span>)
    <span style="font-style: italic;">"w s"</span> '(evil-window-split <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Horizontal split window"</span>)
    <span style="font-style: italic;">"w v"</span> '(evil-window-vsplit <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Vertical split window"</span>)
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Window motions</span>
    <span style="font-style: italic;">"w h"</span> '(evil-window-left <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Window left"</span>)
    <span style="font-style: italic;">"w j"</span> '(evil-window-down <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Window down"</span>)
    <span style="font-style: italic;">"w k"</span> '(evil-window-up <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Window up"</span>)
    <span style="font-style: italic;">"w l"</span> '(evil-window-right <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Window right"</span>)
    <span style="font-style: italic;">"w w"</span> '(evil-window-next <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Goto next window"</span>)
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Move Windows</span>
    <span style="font-style: italic;">"w H"</span> '(buf-move-left <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Buffer move left"</span>)
    <span style="font-style: italic;">"w J"</span> '(buf-move-down <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Buffer move down"</span>)
    <span style="font-style: italic;">"w K"</span> '(buf-move-up <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Buffer move up"</span>)
    <span style="font-style: italic;">"w L"</span> '(buf-move-right <span style="font-weight: bold;">:wk</span> <span style="font-style: italic;">"Buffer move right"</span>)))  

</pre>
</div>
</div>
</div>
</div>
