skeleton_files/emacs_config.org
* Terminal Frameworks

** Vterm Settings

This Emacs Lisp script configures the vterm package, providing a terminal emulator within Emacs, and the vterm-toggle package for toggling vterm windows. vterm is set up to recognize custom shell prompts, launch the zsh shell, and limit scrollback. Meanwhile, vterm-toggle is configured to disable fullscreen mode, employ a 'project' scope, and modify buffer display rules, ensuring vterm buffers appear at the bottom of the screen. These configurations optimize the terminal emulation experience in Emacs.

#+BEGIN_SRC emacs-lisp

;; Use vterm package
(use-package vterm
  :ensure t
  :commands vterm
  :config
  ;; Set this to match your custom shell prompt
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")     
  ;; Set this to customize the shell to launch
  (setq vterm-shell "/bin/zsh")                       
  ;; Set maximum scrollback limit in terminal buffer
  (setq vterm-max-scrollback 10000))

;; Use vterm-toggle package after vterm
(use-package vterm-toggle
  :ensure t
  :after vterm
  :config
  ;; Disable fullscreen mode
  (setq vterm-toggle-fullscreen-p nil)
  ;; Set scope to 'project'
  (setq vterm-toggle-scope 'project)
  ;; Add rule to display buffer alist for displaying vterm buffers at bottom of screen
  (add-to-list 'display-buffer-alist '((lambda (buffer-or-name _)
                                         (let ((buffer (get-buffer buffer-or-name)))
                                           (with-current-buffer buffer
                                             (or (equal major-mode 'vterm-mode)
                                                 (string-prefix-p vterm-buffer-name
                                                                   (buffer-name buffer))))))
                                       (display-buffer-reuse-window display-buffer-at-bottom)
                                       (reusable-frames . visible)
                                       (window-height . 0.4))))

#+END_SRC

