emacs_config.html

<div id="outline-container-org43e20e5" class="outline-2">
<h2 id="org43e20e5">Terminal Frameworks</h2>
<div class="outline-text-2" id="text-org43e20e5">
</div>
<div id="outline-container-orgb2e915c" class="outline-3">
<h3 id="orgb2e915c">Vterm Settings</h3>
<div class="outline-text-3" id="text-orgb2e915c">
<p>
This Emacs Lisp script configures the vterm package, providing a terminal emulator within Emacs, and the vterm-toggle package for toggling vterm windows. vterm is set up to recognize custom shell prompts, launch the zsh shell, and limit scrollback. Meanwhile, vterm-toggle is configured to disable fullscreen mode, employ a 'project' scope, and modify buffer display rules, ensuring vterm buffers appear at the bottom of the screen. These configurations optimize the terminal emulation experience in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use vterm package</span>
(use-package vterm
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:commands</span> vterm
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set this to match your custom shell prompt</span>
  (<span style="font-weight: bold;">setq</span> term-prompt-regexp <span style="font-style: italic;">"^[</span><span style="font-style: italic;">^</span><span style="font-style: italic;">#$%&gt;\n]*[#$%&gt;] *"</span>)     
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set this to customize the shell to launch</span>
  (<span style="font-weight: bold;">setq</span> vterm-shell <span style="font-style: italic;">"/bin/zsh"</span>)                       
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set maximum scrollback limit in terminal buffer</span>
  (<span style="font-weight: bold;">setq</span> vterm-max-scrollback 10000))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use vterm-toggle package after vterm</span>
(use-package vterm-toggle
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> vterm
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable fullscreen mode</span>
  (<span style="font-weight: bold;">setq</span> vterm-toggle-fullscreen-p nil)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set scope to 'project'</span>
  (<span style="font-weight: bold;">setq</span> vterm-toggle-scope 'project)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add rule to display buffer alist for displaying vterm buffers at bottom of screen</span>
  (add-to-list 'display-buffer-alist '((<span style="font-weight: bold;">lambda</span> (buffer-or-name _)
                                         (<span style="font-weight: bold;">let</span> ((buffer (get-buffer buffer-or-name)))
                                           (<span style="font-weight: bold;">with-current-buffer</span> buffer
                                             (<span style="font-weight: bold;">or</span> (equal major-mode 'vterm-mode)
                                                 (string-prefix-p vterm-buffer-name
                                                                   (buffer-name buffer))))))
                                       (display-buffer-reuse-window display-buffer-at-bottom)
                                       (reusable-frames . visible)
                                       (window-height . 0.4))))

</pre>
</div>
</div>
</div>
