skeleton_files/emacs_config.org
** Eshell Settings

This Emacs Lisp script configures two packages: 'eshell-toggle' and 'eshell-syntax-highlighting.' The 'eshell-toggle' package is set up to toggle Eshell windows, with options for size fraction, projectile root usage, and Eshell initialization. It avoids executing any command when toggling Eshell. The 'eshell-syntax-highlighting' package adds syntax highlighting to Eshell, activated after eshell-mode. Configuration includes enabling global syntax highlighting, using a powerline theme for the git prompt, specifying history size and maximum lines, managing duplicates in the history, and adjusting scrolling behavior and buffer handling. Additionally, the script disables company mode in Eshell, adds a hook for disabling company mode when entering Eshell, and enhances tab completion in Eshell through setup functions and a hook added to eshell-mode-hook.

#+BEGIN_SRC emacs-lisp

;; Use eshell-toggle package
(use-package eshell-toggle
  :ensure t
  :custom
  ;; Set the size fraction for eshell-toggle
  (eshell-toggle-size-fraction 4)
  ;; Enable use of projectile root in eshell-toggle
  (eshell-toggle-use-projectile-root t)
  ;; Uncomment to initialize ansi-term in eshell-toggle
  ;;(eshell-toggle-init-function #'eshell-toggle-init-ansi-term)
  ;; Initialize eshell in eshell-toggle
  (eshell-toggle-init-function #'eshell-toggle-init-eshell)
  ;; Do not run any command when toggling eshell
  (eshell-toggle-run-command nil))

;; Use eshell-syntax-highlighting package after eshell-mode
(use-package eshell-syntax-highlighting
  :after eshell-mode
  :ensure t
  :config
  ;; Enable global mode for eshell syntax highlighting
  (eshell-syntax-highlighting-global-mode +1)
  ;; Use powerline theme for git prompt in eshell
  (eshell-git-prompt-use-theme 'powerline)
  ;; Set history size for eshell
  (setq eshell-history-size 5000)
  ;; Set maximum lines for eshell buffer
  (setq eshell-buffer-maximum-lines 5000)
  ;; Ignore duplicates in eshell history
  (setq eshell-hist-ignoredups t)
  ;; Scroll to bottom on input in eshell
  (setq eshell-scroll-to-bottom-on-input t)
  ;; Destroy buffer when process dies in eshell
  (setq eshell-destroy-buffer-when-process-dies t)
  ;; List of visual commands for eshell
  (setq eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh")))

;; Function to disable company mode in eshell
(defun my-disable-company-in-eshell ()
  (company-mode -1))
  
;; Add hook to disable company mode when entering eshell mode
(add-hook 'eshell-mode-hook 'my-disable-company-in-eshell)

;; Configure eshell for better tab completion
(defun pcmpl-eshell-setup ()
  "Setup `pcmpl-eshell'. This must be run from `eshell-mode-hook'."
  (when (and (boundp 'eshell-buffer-name)
             eshell-buffer-name)
    (unless (file-remote-p default-directory)
      ;; Make sure our setup function has been called
      (unless (advice-function-member-p #'pcmpl-eshell-setup eshell-dynamic-complete-functions)
        (add-hook 'eshell-dynamic-complete-functions #'pcmpl-eshell-setup t))
      ;; If pcomplete was not active, we activate it now.
      ;; We also remove the hook, as it is no longer necessary.
      (unless pcomplete-active-p
        (remove-hook 'eshell-dynamic-complete-functions #'pcmpl-eshell-setup)
        (setq-local pcomplete-cycle-completions nil)
        (let ((buf eshell-buffer-name))
          (with-temp-buffer
            (shell-command (format "ls -aF %s" default-directory) t)
            (goto-char (point-min))
            (while (re-search-forward "^\\([^[:space:]]+\\)$" nil t)
              (ignore-errors
                (pcomplete-here*
                 (list
                  (replace-regexp-in-string "/$" "" (match-string-no-properties 0)))))))
          (if (called-interactively-p 'any)
              (message "Pcomplete shell setup done.")
            (eshell-buffer-name)))))))

(add-hook 'eshell-mode-hook #'pcmpl-eshell-setup)

#+END_SRC

* Completion Frameworks

