emacs_config.html

<div id="outline-container-org438e4bf" class="outline-3">
<h3 id="org438e4bf">Eshell Settings</h3>
<div class="outline-text-3" id="text-org438e4bf">
<p>
This Emacs Lisp script configures two packages: 'eshell-toggle' and 'eshell-syntax-highlighting.' The 'eshell-toggle' package is set up to toggle Eshell windows, with options for size fraction, projectile root usage, and Eshell initialization. It avoids executing any command when toggling Eshell. The 'eshell-syntax-highlighting' package adds syntax highlighting to Eshell, activated after eshell-mode. Configuration includes enabling global syntax highlighting, using a powerline theme for the git prompt, specifying history size and maximum lines, managing duplicates in the history, and adjusting scrolling behavior and buffer handling. Additionally, the script disables company mode in Eshell, adds a hook for disabling company mode when entering Eshell, and enhances tab completion in Eshell through setup functions and a hook added to eshell-mode-hook.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use eshell-toggle package</span>
(use-package eshell-toggle
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:custom</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the size fraction for eshell-toggle</span>
  (eshell-toggle-size-fraction 4)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable use of projectile root in eshell-toggle</span>
  (eshell-toggle-use-projectile-root t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Uncomment to initialize ansi-term in eshell-toggle</span>
  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(eshell-toggle-init-function #'eshell-toggle-init-ansi-term)</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize eshell in eshell-toggle</span>
  (eshell-toggle-init-function #'eshell-toggle-init-eshell)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Do not run any command when toggling eshell</span>
  (eshell-toggle-run-command nil))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use eshell-syntax-highlighting package after eshell-mode</span>
(use-package eshell-syntax-highlighting
  <span style="font-weight: bold;">:after</span> eshell-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable global mode for eshell syntax highlighting</span>
  (eshell-syntax-highlighting-global-mode +1)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use powerline theme for git prompt in eshell</span>
  (eshell-git-prompt-use-theme 'powerline)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set history size for eshell</span>
  (<span style="font-weight: bold;">setq</span> eshell-history-size 5000)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set maximum lines for eshell buffer</span>
  (<span style="font-weight: bold;">setq</span> eshell-buffer-maximum-lines 5000)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ignore duplicates in eshell history</span>
  (<span style="font-weight: bold;">setq</span> eshell-hist-ignoredups t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Scroll to bottom on input in eshell</span>
  (<span style="font-weight: bold;">setq</span> eshell-scroll-to-bottom-on-input t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Destroy buffer when process dies in eshell</span>
  (<span style="font-weight: bold;">setq</span> eshell-destroy-buffer-when-process-dies t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">List of visual commands for eshell</span>
  (<span style="font-weight: bold;">setq</span> eshell-visual-commands'(<span style="font-style: italic;">"bash"</span> <span style="font-style: italic;">"fish"</span> <span style="font-style: italic;">"htop"</span> <span style="font-style: italic;">"ssh"</span> <span style="font-style: italic;">"top"</span> <span style="font-style: italic;">"zsh"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Function to disable company mode in eshell</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-disable-company-in-eshell</span> ()
  (company-mode -1))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add hook to disable company mode when entering eshell mode</span>
(add-hook 'eshell-mode-hook 'my-disable-company-in-eshell)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure eshell for better tab completion</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">pcmpl-eshell-setup</span> ()
  <span style="font-style: italic;">"Setup `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">pcmpl-eshell</span><span style="font-style: italic;">'. This must be run from `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">eshell-mode-hook</span><span style="font-style: italic;">'."</span>
  (<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">and</span> (boundp 'eshell-buffer-name)
             eshell-buffer-name)
    (<span style="font-weight: bold;">unless</span> (file-remote-p default-directory)
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Make sure our setup function has been called</span>
      (<span style="font-weight: bold;">unless</span> (advice-function-member-p #'pcmpl-eshell-setup eshell-dynamic-complete-functions)
        (add-hook 'eshell-dynamic-complete-functions #'pcmpl-eshell-setup t))
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">If pcomplete was not active, we activate it now.</span>
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">We also remove the hook, as it is no longer necessary.</span>
      (<span style="font-weight: bold;">unless</span> pcomplete-active-p
        (remove-hook 'eshell-dynamic-complete-functions #'pcmpl-eshell-setup)
        (<span style="font-weight: bold;">setq-local</span> pcomplete-cycle-completions nil)
        (<span style="font-weight: bold;">let</span> ((buf eshell-buffer-name))
          (<span style="font-weight: bold;">with-temp-buffer</span>
            (shell-command (format <span style="font-style: italic;">"ls -aF %s"</span> default-directory) t)
            (goto-char (point-min))
            (<span style="font-weight: bold;">while</span> (re-search-forward <span style="font-style: italic;">"^</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">[</span><span style="font-style: italic;">^</span><span style="font-style: italic;">[:space:]]+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">$"</span> nil t)
              (<span style="font-weight: bold;">ignore-errors</span>
                (<span style="font-weight: bold;">pcomplete-here*</span>
                 (list
                  (replace-regexp-in-string <span style="font-style: italic;">"/$"</span> <span style="font-style: italic;">""</span> (match-string-no-properties 0)))))))
          (<span style="font-weight: bold;">if</span> (called-interactively-p 'any)
              (message <span style="font-style: italic;">"Pcomplete shell setup done."</span>)
            (eshell-buffer-name)))))))

(add-hook 'eshell-mode-hook #'pcmpl-eshell-setup)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd07299" class="outline-2">
<h2 id="orgdd07299">Completion Frameworks</h2>
<div class="outline-text-2" id="text-orgdd07299">
</div>
