skeleton_files/emacs_config.org
** Vertico Mode Settings

The provided Emacs Lisp script enhances the user interface and functionality of Emacs through various package configurations. It begins by setting up the 'vertico' package for minibuffer completion, customizing grid separators, lookahead, display actions, multiform categories, and commands. Additionally, it defines functions to toggle between flat and reverse modes in 'vertico' multiform, embark on a candidate using quick keys, and provides a workaround for tramp hostname completions. Next, it enables 'savehist-mode' to store minibuffer history across sessions. The script then configures the 'marginalia' package, adjusting options related to minibuffer annotations and enabling 'marginalia' mode. Afterward, it configures the 'embark' package, binding keys for 'embark act' and related bindings, replacing the key help with a completing-read interface. Finally, it uses the 'orderless' package to set completion styles, clear default completion categories, and override completion categories for files. These configurations collectively improve the usability and efficiency of Emacs.

#+BEGIN_SRC emacs-lisp

;; Use vertico package
(use-package vertico
  :demand t
  :elpaca
  ;; Special recipe to load extensions conveniently
  (vertico  :files (:defaults "extensions/*") 
            :includes (vertico-indexed
                       vertico-flat
                       vertico-grid
                       vertico-mouse
                       vertico-quick
                       vertico-buffer
                       vertico-repeat
                       vertico-reverse
                       vertico-directory
                       vertico-multiform
                       vertico-unobtrusive
                       vertico-suspend))
  :custom
  ;; Set separator for vertico grid
  (vertico-grid-separator "  ")
  ;; Set lookahead for vertico grid
  (vertico-grid-lookahead 50)
  ;; Set display action for vertico buffer
  (vertico-buffer-display-action '(display-buffer-reuse-window))
  ;; Set categories for multiform in vertico
  (vertico-multiform-categories
   '((file reverse)
     (consult-grep buffer)
     (consult-location)
     (imenu buffer)
     (library reverse indexed)
     (org-roam-node reverse indexed)
     (t reverse)))
  ;; Set commands for multiform in vertico
  (vertico-multiform-commands
   '(("flyspell-correct-*" grid reverse)
     (org-refile grid reverse indexed)
     (consult-yank-pop indexed)
     (consult-flycheck)
     (consult-lsp-diagnostics)))

  :init
  ;; Function to toggle between flat and reverse in vertico multiform
  (defun ACH/vertico-multiform-flat-toggle ()
    "Toggle between flat and reverse."
    (interactive)
    (vertico-multiform--display-toggle 'vertico-flat-mode)
    (if vertico-flat-mode
        (vertico-multiform--temporary-mode 'vertico-reverse-mode -1)
      (vertico-multiform--temporary-mode 'vertico-reverse-mode 1)))

  ;; Function to embark on candidate using quick keys in vertico
  (defun ACH/vertico-quick-embark (&optional arg)
    "Embark on candidate using quick keys."
    (interactive)
    (when (vertico-quick-jump)
      (embark-act arg)))

  ;; Workaround for problem with `tramp' hostname completions. This overrides
  ;; the completion style specifically for remote files! See
  ;; https://github.com/minad/vertico#tramp-hostname-completion
  (defun ACH/basic-remote-try-completion (string table pred point)
    (and (vertico--remote-p string)
         (completion-basic-try-completion string table pred point)))
  (defun ACH/basic-remote-all-completions (string table pred point)
    (and (vertico--remote-p string)
         (completion-basic-all-completions string table pred point)))
  (add-to-list 'completion-styles-alist
               '(basic-remote           ; Name of `completion-style'
                 ACH/basic-remote-try-completion ACH/basic-remote-all-completions nil))

  :config
  ;; Enable vertico mode and multiform mode
  (vertico-mode)
  (vertico-multiform-mode)
  ;; Set resize, cycle and ignore case options for vertico
  (setq vertico-resize t)
  (setq vertico-cycle t)
  (setq read-file-name-completion-ignore-case t)
  (setq read-buffer-completion-ignore-case t)
  (setq completion-ignore-case t)
  ;; Set function for completion in region
  (setq completion-in-region-function
        (lambda (&rest args)
          (apply (if vertico-mode
                     #'consult-completion-in-region
                   #'completion--in-region)
                 args))))

;; Enable savehist mode
(savehist-mode 1)

;; Use marginalia package after vertico
(use-package marginalia
  :after vertico
  :custom
  ;; Set max relative age and align options for marginalia
  (marginalia-max-relative-age 0)
  (marginalia-align 'right)
  :config
  ;; Enable marginalia mode
  (marginalia-mode))

;; Use embark package
(use-package embark
  :bind
  ;; Bind keys for embark act and bindings
  (("C-S-a" . embark-act)         ;; pick some comfortable binding
   ("C-h B" . embark-bindings))   ;; alternative for `describe-bindings'
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command))

;; Use orderless package
(use-package orderless
  :init
  ;; Set completion styles for orderless
  (setq completion-styles '(substring orderless basic))
  ;; Clear default completion categories
  (setq completion-category-defaults nil)
  ;; Override completion categories for files
  (setq completion-category-overrides '((file (styles partial-completion)))))

#+END_SRC

