emacs_config.html
<div id="outline-container-org566565d" class="outline-3">
<h3 id="org566565d">Vertico Mode Settings</h3>
<div class="outline-text-3" id="text-org566565d">
<p>
The provided Emacs Lisp script enhances the user interface and functionality of Emacs through various package configurations. It begins by setting up the 'vertico' package for minibuffer completion, customizing grid separators, lookahead, display actions, multiform categories, and commands. Additionally, it defines functions to toggle between flat and reverse modes in 'vertico' multiform, embark on a candidate using quick keys, and provides a workaround for tramp hostname completions. Next, it enables 'savehist-mode' to store minibuffer history across sessions. The script then configures the 'marginalia' package, adjusting options related to minibuffer annotations and enabling 'marginalia' mode. Afterward, it configures the 'embark' package, binding keys for 'embark act' and related bindings, replacing the key help with a completing-read interface. Finally, it uses the 'orderless' package to set completion styles, clear default completion categories, and override completion categories for files. These configurations collectively improve the usability and efficiency of Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use vertico package</span>
(use-package vertico
  <span style="font-weight: bold;">:demand</span> t
  <span style="font-weight: bold;">:elpaca</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Special recipe to load extensions conveniently</span>
  (vertico  <span style="font-weight: bold;">:files</span> (<span style="font-weight: bold;">:defaults</span> <span style="font-style: italic;">"extensions/*"</span>) 
            <span style="font-weight: bold;">:includes</span> (vertico-indexed
                       vertico-flat
                       vertico-grid
                       vertico-mouse
                       vertico-quick
                       vertico-buffer
                       vertico-repeat
                       vertico-reverse
                       vertico-directory
                       vertico-multiform
                       vertico-unobtrusive
                       vertico-suspend))
  <span style="font-weight: bold;">:custom</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set separator for vertico grid</span>
  (vertico-grid-separator <span style="font-style: italic;">"  "</span>)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set lookahead for vertico grid</span>
  (vertico-grid-lookahead 50)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set display action for vertico buffer</span>
  (vertico-buffer-display-action '(display-buffer-reuse-window))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set categories for multiform in vertico</span>
  (vertico-multiform-categories
   '((file reverse)
     (consult-grep buffer)
     (consult-location)
     (imenu buffer)
     (library reverse indexed)
     (org-roam-node reverse indexed)
     (t reverse)))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set commands for multiform in vertico</span>
  (vertico-multiform-commands
   '((<span style="font-style: italic;">"flyspell-correct-*"</span> grid reverse)
     (org-refile grid reverse indexed)
     (consult-yank-pop indexed)
     (consult-flycheck)
     (consult-lsp-diagnostics)))

  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Function to toggle between flat and reverse in vertico multiform</span>
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">ACH/vertico-multiform-flat-toggle</span> ()
    <span style="font-style: italic;">"Toggle between flat and reverse."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (vertico-multiform--display-toggle 'vertico-flat-mode)
    (<span style="font-weight: bold;">if</span> vertico-flat-mode
        (vertico-multiform--temporary-mode 'vertico-reverse-mode -1)
      (vertico-multiform--temporary-mode 'vertico-reverse-mode 1)))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Function to embark on candidate using quick keys in vertico</span>
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">ACH/vertico-quick-embark</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> arg)
    <span style="font-style: italic;">"Embark on candidate using quick keys."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">when</span> (vertico-quick-jump)
      (embark-act arg)))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Workaround for problem with `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">tramp</span><span style="font-weight: bold; font-style: italic;">' hostname completions. This overrides</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">the completion style specifically for remote files! See</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">https://github.com/minad/vertico#tramp-hostname-completion</span>
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">ACH/basic-remote-try-completion</span> (string table pred point)
    (<span style="font-weight: bold;">and</span> (vertico--remote-p string)
         (completion-basic-try-completion string table pred point)))
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">ACH/basic-remote-all-completions</span> (string table pred point)
    (<span style="font-weight: bold;">and</span> (vertico--remote-p string)
         (completion-basic-all-completions string table pred point)))
  (add-to-list 'completion-styles-alist
               '(basic-remote           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Name of `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">completion-style</span><span style="font-weight: bold; font-style: italic;">'</span>
                 ACH/basic-remote-try-completion ACH/basic-remote-all-completions nil))

  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable vertico mode and multiform mode</span>
  (vertico-mode)
  (vertico-multiform-mode)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set resize, cycle and ignore case options for vertico</span>
  (<span style="font-weight: bold;">setq</span> vertico-resize t)
  (<span style="font-weight: bold;">setq</span> vertico-cycle t)
  (<span style="font-weight: bold;">setq</span> read-file-name-completion-ignore-case t)
  (<span style="font-weight: bold;">setq</span> read-buffer-completion-ignore-case t)
  (<span style="font-weight: bold;">setq</span> completion-ignore-case t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set function for completion in region</span>
  (<span style="font-weight: bold;">setq</span> completion-in-region-function
        (<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> args)
          (apply (<span style="font-weight: bold;">if</span> vertico-mode
                     #'consult-completion-in-region
                   #'completion--in-region)
                 args))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable savehist mode</span>
(savehist-mode 1)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use marginalia package after vertico</span>
(use-package marginalia
  <span style="font-weight: bold;">:after</span> vertico
  <span style="font-weight: bold;">:custom</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set max relative age and align options for marginalia</span>
  (marginalia-max-relative-age 0)
  (marginalia-align 'right)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable marginalia mode</span>
  (marginalia-mode))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use embark package</span>
(use-package embark
  <span style="font-weight: bold;">:bind</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind keys for embark act and bindings</span>
  ((<span style="font-style: italic;">"C-S-a"</span> . embark-act)         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">pick some comfortable binding</span>
   (<span style="font-style: italic;">"C-h B"</span> . embark-bindings))   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">alternative for `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">describe-bindings</span><span style="font-weight: bold; font-style: italic;">'</span>
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Optionally replace the key help with a completing-read interface</span>
  (<span style="font-weight: bold;">setq</span> prefix-help-command #'embark-prefix-help-command))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use orderless package</span>
(use-package orderless
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set completion styles for orderless</span>
  (<span style="font-weight: bold;">setq</span> completion-styles '(substring orderless basic))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Clear default completion categories</span>
  (<span style="font-weight: bold;">setq</span> completion-category-defaults nil)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Override completion categories for files</span>
  (<span style="font-weight: bold;">setq</span> completion-category-overrides '((file (styles partial-completion)))))

</pre>
</div>
</div>
</div>
