skeleton_files/emacs_config.org
** Consult Mode Settings

This Emacs Lisp script is dedicated to configuring several packages that enhance various aspects of interactive search, navigation, and code management within Emacs, all built around the 'consult' package as a foundation. It begins with comprehensive 'consult' package customization, enabling preview modes, defining register preview behavior, and optimizing 'xref' functionality. The script then incorporates 'consult-todo' for managing TODO items, 'consult-flycheck' to integrate Flycheck's error list, and 'consult-dir' for improved directory navigation. Together, these configurations significantly augment the user experience in Emacs, facilitating efficient code navigation, error checking, and task management.

#+BEGIN_SRC emacs-lisp

;; Use consult package
(use-package consult
  :ensure t
  :hook
  ;; Enable consult preview at point mode in completion list mode
  (completion-list-mode . consult-preview-at-point-mode)
  :init
  ;; Set register preview delay and function for consult
  (setq register-preview-delay 0.5 
        register-preview-function #'consult-register-format)
  ;; Override register preview with consult register window
  (advice-add #'register-preview :override #'consult-register-window)
  ;; Set xref show functions to use consult-xref
  (setq xref-show-xrefs-function #'consult-xref 
        xref-show-definitions-function #'consult-xref))

;; Use consult-todo package
(use-package consult-todo
  :ensure t
  :demand t
  :elpaca (:host github :repo "liuyinz/consult-todo"))

;; Define narrowing options for consult-todo
(defconst consult-todo--narrow '( (?t . "TODO")
                                  (?f . "FIXME")
                                  (?b . "BUG")
                                  (?h . "HACK")))

;; Use consult-flycheck package after flycheck
(use-package consult-flycheck
  :ensure t
  :after flycheck
  :bind (:map flycheck-command-map ("!" . consult-flycheck)))

;; Use consult-dir package for directory navigation features
(use-package consult-dir
  :ensure t   ;; Ensure that the package is installed
  ;; Bind keys to consult-dir commands
  :bind (
         ;; Globally bind "C-x C-d" to consult-dir command. This allows you to select a directory from 
         ;; recently visited directories or bookmarks.
         ("C-x C-d" . consult-dir)
         ;; In Vertico context (i.e., when Vertico minibuffer is active), bind "C-x C-d" to consult-dir command.
         :map vertico-map
         ("C-x C-d" . consult-dir)
         ;; In Vertico context, bind "C-x C-j" to consult-dir-jump-file command. This allows you to jump directly 
         ;; to a file within the selected directory.
         ("C-x C-j" . consult-dir-jump-file)))

#+END_SRC

* Programming Settings

** Flycheck Settings

This Emacs Lisp script configures the flycheck package, which is used for on-the-fly syntax checking in Emacs. The configuration ensures that the package is installed and diminishes its mode line lighters to reduce clutter. It also enables flycheck mode automatically in all programming modes by adding it to the 'prog-mode-hook'.

#+BEGIN_SRC emacs-lisp

;; Use flycheck package
(use-package flycheck
  :ensure t
  :diminish
  :init
  ;; Enable flycheck mode in programming modes
  (add-hook 'prog-mode-hook #'flycheck-mode))

#+END_SRC

** Highlight TODO Settings

This Emacs Lisp script configures the hl-todo package, which is used for highlighting TODO and similar keywords in comments and strings. The configuration ensures that the package is installed and enables hl-todo mode automatically in org-mode and prog-mode. It also sets punctuation for highlighting and customizes faces (colors and styles) for different keywords such as "TODO", "FIXME", "HACK", "REVIEW", "NOTE", and "DEPRECATED".

#+BEGIN_SRC emacs-lisp

;; Use hl-todo package
(use-package hl-todo
  :ensure t
  :hook 
  ;; Enable hl-todo mode in org-mode and prog-mode
  ((org-mode . hl-todo-mode)
   (prog-mode . hl-todo-mode))
  :config
  ;; Set punctuation for highlighting and faces for keywords in hl-todo
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        `(("TODO"       warning bold)
          ("FIXME"      error bold)
          ("HACK"       font-lock-constant-face bold)
          ("REVIEW"     font-lock-keyword-face bold)
          ("NOTE"       success bold)
          ("DEPRECATED" font-lock-doc-face bold))))

#+END_SRC

