emacs_config.html

<div id="outline-container-orgf72d535" class="outline-3">
<h3 id="orgf72d535">Consult Mode Settings</h3>
<div class="outline-text-3" id="text-orgf72d535">
<p>
This Emacs Lisp script is dedicated to configuring several packages that enhance various aspects of interactive search, navigation, and code management within Emacs, all built around the 'consult' package as a foundation. It begins with comprehensive 'consult' package customization, enabling preview modes, defining register preview behavior, and optimizing 'xref' functionality. The script then incorporates 'consult-todo' for managing TODO items, 'consult-flycheck' to integrate Flycheck's error list, and 'consult-dir' for improved directory navigation. Together, these configurations significantly augment the user experience in Emacs, facilitating efficient code navigation, error checking, and task management.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use consult package</span>
(use-package consult
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable consult preview at point mode in completion list mode</span>
  (completion-list-mode . consult-preview-at-point-mode)
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set register preview delay and function for consult</span>
  (<span style="font-weight: bold;">setq</span> register-preview-delay 0.5 
        register-preview-function #'consult-register-format)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Override register preview with consult register window</span>
  (advice-add #'register-preview <span style="font-weight: bold;">:override</span> #'consult-register-window)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set xref show functions to use consult-xref</span>
  (<span style="font-weight: bold;">setq</span> xref-show-xrefs-function #'consult-xref 
        xref-show-definitions-function #'consult-xref))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use consult-todo package</span>
(use-package consult-todo
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:demand</span> t
  <span style="font-weight: bold;">:elpaca</span> (<span style="font-weight: bold;">:host</span> github <span style="font-weight: bold;">:repo</span> <span style="font-style: italic;">"liuyinz/consult-todo"</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define narrowing options for consult-todo</span>
(<span style="font-weight: bold;">defconst</span> <span style="font-weight: bold; font-style: italic;">consult-todo--narrow</span> '( (?t . <span style="font-style: italic;">"TODO"</span>)
                                  (?f . <span style="font-style: italic;">"FIXME"</span>)
                                  (?b . <span style="font-style: italic;">"BUG"</span>)
                                  (?h . <span style="font-style: italic;">"HACK"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use consult-flycheck package after flycheck</span>
(use-package consult-flycheck
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> flycheck
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> flycheck-command-map (<span style="font-style: italic;">"!"</span> . consult-flycheck)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use consult-dir package for directory navigation features</span>
(use-package consult-dir
  <span style="font-weight: bold;">:ensure</span> t   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ensure that the package is installed</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind keys to consult-dir commands</span>
  <span style="font-weight: bold;">:bind</span> (
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Globally bind "C-x C-d" to consult-dir command. This allows you to select a directory from </span>
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">recently visited directories or bookmarks.</span>
         (<span style="font-style: italic;">"C-x C-d"</span> . consult-dir)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">In Vertico context (i.e., when Vertico minibuffer is active), bind "C-x C-d" to consult-dir command.</span>
         <span style="font-weight: bold;">:map</span> vertico-map
         (<span style="font-style: italic;">"C-x C-d"</span> . consult-dir)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">In Vertico context, bind "C-x C-j" to consult-dir-jump-file command. This allows you to jump directly </span>
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">to a file within the selected directory.</span>
         (<span style="font-style: italic;">"C-x C-j"</span> . consult-dir-jump-file)))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0fc3c50" class="outline-2">
<h2 id="org0fc3c50">Programming Settings</h2>
<div class="outline-text-2" id="text-org0fc3c50">
</div>
<div id="outline-container-org11b416a" class="outline-3">
<h3 id="org11b416a">Flycheck Settings</h3>
<div class="outline-text-3" id="text-org11b416a">
<p>
This Emacs Lisp script configures the flycheck package, which is used for on-the-fly syntax checking in Emacs. The configuration ensures that the package is installed and diminishes its mode line lighters to reduce clutter. It also enables flycheck mode automatically in all programming modes by adding it to the 'prog-mode-hook'.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use flycheck package</span>
(use-package flycheck
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:diminish</span>
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable flycheck mode in programming modes</span>
  (add-hook 'prog-mode-hook #'flycheck-mode))

</pre>
</div>
</div>
</div>

<div id="outline-container-org8646ba3" class="outline-3">
<h3 id="org8646ba3">Highlight TODO Settings</h3>
<div class="outline-text-3" id="text-org8646ba3">
<p>
This Emacs Lisp script configures the hl-todo package, which is used for highlighting TODO and similar keywords in comments and strings. The configuration ensures that the package is installed and enables hl-todo mode automatically in org-mode and prog-mode. It also sets punctuation for highlighting and customizes faces (colors and styles) for different keywords such as "TODO", "FIXME", "HACK", "REVIEW", "NOTE", and "DEPRECATED".
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use hl-todo package</span>
(use-package hl-todo
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable hl-todo mode in org-mode and prog-mode</span>
  ((org-mode . hl-todo-mode)
   (prog-mode . hl-todo-mode))
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set punctuation for highlighting and faces for keywords in hl-todo</span>
  (<span style="font-weight: bold;">setq</span> hl-todo-highlight-punctuation <span style="font-style: italic;">":"</span>
        hl-todo-keyword-faces
        `((<span style="font-style: italic;">"TODO"</span>       warning bold)
          (<span style="font-style: italic;">"FIXME"</span>      error bold)
          (<span style="font-style: italic;">"HACK"</span>       font-lock-constant-face bold)
          (<span style="font-style: italic;">"REVIEW"</span>     font-lock-keyword-face bold)
          (<span style="font-style: italic;">"NOTE"</span>       success bold)
          (<span style="font-style: italic;">"DEPRECATED"</span> font-lock-doc-face bold))))

</pre>
</div>
</div>
</div>
