emacs_config.html

<div id="outline-container-org34546da" class="outline-3">
<h3 id="org34546da">LSP Settings</h3>
<div class="outline-text-3" id="text-org34546da">
<p>
This Emacs Lisp script configures several packages related to the Language Server Protocol (LSP) to enhance the development experience for various programming languages. It begins by setting up 'lsp-mode,' enabling 'lsp-deferred' in various modes, and defining commands and options. Then, it configures 'lsp-ui,' which provides additional UI elements like sideline diagnostics and documentation popups, with various customization options. For Python development, 'lsp-pyright' is used, integrated into 'python-mode' and configuring the Python executable command. 'lsp-java' is loaded for Java development. Lastly, it ensures the installation of 'consult-lsp' to integrate 'Consult' with 'LSP,' improving code navigation and completion. These configurations collectively enhance the IDE-like features for multiple programming languages in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use lsp-mode package</span>
(use-package lsp-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable lsp-deferred in various programming modes</span>
  ((c-mode
    c++-mode
    c-or-c++-mode
    java-mode
    js-mode
    js-jsx-mode
    typescript-mode
    python-mode
    web-mode
    verilog-mode
    haskell-mode) <span style="font-weight: bold;">. lsp-deferred)</span>
  <span style="font-weight: bold;">:commands</span> lsp
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set various options for lsp-mode</span>
  (<span style="font-weight: bold;">setq</span> lsp-log-io nil
        lsp-auto-configure t
        lsp-auto-guess-root t
        lsp-enable-symbol-highlighting t
        lsp-enable-on-type-formatting t
        lsp-signature-auto-activate t
        lsp-signature-render-documentation t
        lsp-enable-completion-at-point t
        lsp-enable-xref t
        lsp-modeline-code-actions-enable t
        lsp-modeline-diagnostics-enable t
        lsp-headerline-breadcrumb-enable t
        lsp-semantic-tokens-enable t
        lsp-prefer-flymake t
        lsp-use-native-json t
        lsp-enable-indentation t
        lsp-enable-imenu t
        lsp-response-timeout 5
        lsp-restart 'auto-restart
        lsp-keep-workspace-alive t
        lsp-eldoc-render-all nil
        lsp-eldoc-hook nil
        read-process-output-max (* 1024 1024)
        lsp-idle-delay 0.5
        lsp-enable-snippet t
        lsp-enable-folding t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use lsp-ui package after lsp-mode</span>
(use-package lsp-ui
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (lsp-mode . lsp-ui-mode)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set various options for lsp-ui</span>
  (<span style="font-weight: bold;">setq</span> lsp-ui-sideline-ignore-duplicate t
        lsp-ui-doc-enable t
        lsp-ui-doc-position 'bottom
        lsp-ui-doc-header t
        lsp-ui-doc-include-signature t
        lsp-ui-doc-border (face-foreground 'default)
        lsp-ui-sideline-delay 0.05
        lsp-ui-sideline-show-symbol t
        lsp-ui-sideline-show-hover t
        lsp-ui-sideline-show-diagnostics t
        lsp-ui-sideline-show-code-actions t
        lsp-ui-peek-always-show t
        lsp-ui-doc-use-childframe t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use lsp-pyright package in python-mode</span>
(use-package lsp-pyright
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (python-mode . (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">lsp-pyright</span>)))
  <span style="font-weight: bold;">:init</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set python executable command if python3 is found</span>
  (<span style="font-weight: bold;">when</span> (executable-find <span style="font-style: italic;">"python3"</span>) 
    (<span style="font-weight: bold;">setq</span> lsp-pyright-python-executable-cmd <span style="font-style: italic;">"python3"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use lsp-java package after lsp</span>
(use-package lsp-java
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> lsp)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use consult-lsp package</span>
(use-package consult-lsp
  <span style="font-weight: bold;">:ensure</span> t)

</pre>
</div>
</div>
</div>
