skeleton_files/emacs_config.org
** Git Settings

This Emacs Lisp script is dedicated to configuring multiple packages for efficient Git version control within the Emacs environment. It commences with 'magit' configuration, a comprehensive Git user interface, adjusting the path to the Git executable and enabling symlink following. A post-refresh hook is included to update the doom modeline. Subsequently, 'forge' is set up to facilitate seamless interactions with Git forges like GitHub and GitLab from within 'magit.' The script also employs 'git-commit' to enhance Git commit message editing by enabling global git commit mode. Furthermore, it configures 'git-gutter+' to display Git diff information in the gutter, making hunk navigation more convenient, and customizes mode line lighters. Additionally, 'git-gutter-fringe+' extends 'git-gutter+' by adding fringe markers, customizing face colors for different changes. Lastly, it ensures the installation of 'git-timemachine,' enabling the stepping through of historic versions of Git-controlled files, with keymaps normalized and custom keys defined for navigation within 'git-timemachine' mode. These configurations collectively optimize Git version control workflows in Emacs.

#+BEGIN_SRC emacs-lisp

;; Use magit package
(use-package magit
  :ensure t
  :commands magit-status
  :custom
  ;; Set git executable path and follow symlinks for magit
  (magit-git-executable "/opt/homebrew/bin/git")
  (vc-follow-symlinks t)
  :config
  ;; Add post-refresh hook for doom modeline
  (add-hook 'magit-post-refresh-hook #'doom-modeline-update-vcs-icon))

;; Use forge package after magit
(use-package forge
  :ensure t
  :after magit)

;; Use git-commit package
(use-package git-commit
  :ensure t
  :config
  ;; Enable global git commit mode
  (global-git-commit-mode))

;; Use git-gutter+ package
(use-package git-gutter+
  :ensure t
  :diminish
  ;; Diminish git gutter+ mode to "gg"
  (git-gutter+-mode . "gg")
  :init
  ;; Enable global git gutter+ mode
  (global-git-gutter+-mode)
  :config
  ;; Set various signs for git gutter+
  (setq git-gutter+-modified-sign "**"
        git-gutter+-added-sign "++"
        git-gutter+-deleted-sign "--"
        git-gutter+-unchanged-sign "//"
        git-gutter+-separator-sign "|"
        git-gutter+-hide-gutter nil))

;; Use git-gutter-fringe+ package
(use-package git-gutter-fringe+
  :ensure t
  :config
  ;; Enable global git gutter+ mode and set face colors
  (global-git-gutter+-mode)
  (set-face-background 'git-gutter-fr+-modified "purple")
  (set-face-foreground 'git-gutter-fr+-modified "green")
  (set-face-foreground 'git-gutter-fr+-modified "red")
  (set-face-background 'git-gutter-fr+-modified "blue")
  (set-face-foreground 'git-gutter-fr+-modified "yellow"))

;; Use git-timemachine package after git-timemachine
(use-package git-timemachine
  :ensure t
  :after git-timemachine
  :hook 
  ;; Add hook for evil normalize keymaps in git timemachine mode
  (evil-normalize-keymaps . git-timemachine-hook)
  :config
  ;; Define keys for showing previous and next revision in git timemachine mode
  (evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
  (evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision))

#+END_SRC

** YASnippet Settings

This Emacs Lisp script configures the yasnippet package, which is used for inserting template snippets in Emacs. The configuration ensures that the package is installed and enables yasnippet globally. It also sets a directory for storing user-defined snippets and reloads all snippets. Finally, it enables yasnippet minor mode automatically in all programming modes by adding it to the 'prog-mode-hook'.

#+BEGIN_SRC emacs-lisp

;; Use yasnippet package
(use-package yasnippet
  :ensure t
  :init
  ;; Enable global yasnippet mode
  (yas-global-mode 1)
  ;; Set directory for yasnippet snippets
  (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
  ;; Reload all snippets
  (yas-reload-all)
  ;; Enable yasnippet minor mode in programming modes
  (add-hook 'prog-mode-hook #'yas-minor-mode))

#+END_SRC

** Markdown Settings

This Emacs Lisp code block is used to install and configure the markdown-mode package in Emacs. It sets up Emacs to automatically use GitHub Flavored Markdown mode (gfm-mode) when opening files with .markdown or .md extensions.

#+BEGIN_SRC emacs-lisp

;; Use markdown-mode package
(use-package markdown-mode
  :ensure t
  :config
  ;; Add .markdown and .md files to auto-mode-alist for gfm-mode (GitHub Flavored Markdown mode)
  (add-to-list 'auto-mode-alist '("\\.markdown" . gfm-mode))
  (add-to-list 'auto-mode-alist '("\\.md" . gfm-mode)))

#+END_SRC

** JSON Settings

This Emacs Lisp code block is used to install and configure the json-mode package in Emacs. It ensures that any file with a .json extension will automatically open in json-mode.

#+BEGIN_SRC emacs-lisp

;; Use json-mode package
(use-package json-mode
  :ensure t
  :config
  ;; Add .json files to auto-mode-alist for json-mode
  (add-to-list 'auto-mode-alist '("\\.json" . json-mode)))

#+END_SRC

