emacs_config.html

<div id="outline-container-orgfaf11de" class="outline-3">
<h3 id="orgfaf11de">Git Settings</h3>
<div class="outline-text-3" id="text-orgfaf11de">
<p>
This Emacs Lisp script is dedicated to configuring multiple packages for efficient Git version control within the Emacs environment. It commences with 'magit' configuration, a comprehensive Git user interface, adjusting the path to the Git executable and enabling symlink following. A post-refresh hook is included to update the doom modeline. Subsequently, 'forge' is set up to facilitate seamless interactions with Git forges like GitHub and GitLab from within 'magit.' The script also employs 'git-commit' to enhance Git commit message editing by enabling global git commit mode. Furthermore, it configures 'git-gutter+' to display Git diff information in the gutter, making hunk navigation more convenient, and customizes mode line lighters. Additionally, 'git-gutter-fringe+' extends 'git-gutter+' by adding fringe markers, customizing face colors for different changes. Lastly, it ensures the installation of 'git-timemachine,' enabling the stepping through of historic versions of Git-controlled files, with keymaps normalized and custom keys defined for navigation within 'git-timemachine' mode. These configurations collectively optimize Git version control workflows in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use magit package</span>
(use-package magit
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:commands</span> magit-status
  <span style="font-weight: bold;">:custom</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set git executable path and follow symlinks for magit</span>
  (magit-git-executable <span style="font-style: italic;">"/opt/homebrew/bin/git"</span>)
  (vc-follow-symlinks t)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add post-refresh hook for doom modeline</span>
  (add-hook 'magit-post-refresh-hook #'doom-modeline-update-vcs-icon))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use forge package after magit</span>
(use-package forge
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> magit)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use git-commit package</span>
(use-package git-commit
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable global git commit mode</span>
  (global-git-commit-mode))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use git-gutter+ package</span>
(use-package git-gutter+
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:diminish</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Diminish git gutter+ mode to "gg"</span>
  (git-gutter+-mode . <span style="font-style: italic;">"gg"</span>)
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable global git gutter+ mode</span>
  (global-git-gutter+-mode)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set various signs for git gutter+</span>
  (<span style="font-weight: bold;">setq</span> git-gutter+-modified-sign <span style="font-style: italic;">"**"</span>
        git-gutter+-added-sign <span style="font-style: italic;">"++"</span>
        git-gutter+-deleted-sign <span style="font-style: italic;">"--"</span>
        git-gutter+-unchanged-sign <span style="font-style: italic;">"//"</span>
        git-gutter+-separator-sign <span style="font-style: italic;">"|"</span>
        git-gutter+-hide-gutter nil))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use git-gutter-fringe+ package</span>
(use-package git-gutter-fringe+
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable global git gutter+ mode and set face colors</span>
  (global-git-gutter+-mode)
  (set-face-background 'git-gutter-fr+-modified <span style="font-style: italic;">"purple"</span>)
  (set-face-foreground 'git-gutter-fr+-modified <span style="font-style: italic;">"green"</span>)
  (set-face-foreground 'git-gutter-fr+-modified <span style="font-style: italic;">"red"</span>)
  (set-face-background 'git-gutter-fr+-modified <span style="font-style: italic;">"blue"</span>)
  (set-face-foreground 'git-gutter-fr+-modified <span style="font-style: italic;">"yellow"</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use git-timemachine package after git-timemachine</span>
(use-package git-timemachine
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> git-timemachine
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add hook for evil normalize keymaps in git timemachine mode</span>
  (evil-normalize-keymaps . git-timemachine-hook)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define keys for showing previous and next revision in git timemachine mode</span>
  (evil-define-key 'normal git-timemachine-mode-map (kbd <span style="font-style: italic;">"C-j"</span>) 'git-timemachine-show-previous-revision)
  (evil-define-key 'normal git-timemachine-mode-map (kbd <span style="font-style: italic;">"C-k"</span>) 'git-timemachine-show-next-revision))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc832fd" class="outline-3">
<h3 id="orgbc832fd">YASnippet Settings</h3>
<div class="outline-text-3" id="text-orgbc832fd">
<p>
This Emacs Lisp script configures the yasnippet package, which is used for inserting template snippets in Emacs. The configuration ensures that the package is installed and enables yasnippet globally. It also sets a directory for storing user-defined snippets and reloads all snippets. Finally, it enables yasnippet minor mode automatically in all programming modes by adding it to the 'prog-mode-hook'.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use yasnippet package</span>
(use-package yasnippet
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable global yasnippet mode</span>
  (yas-global-mode 1)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set directory for yasnippet snippets</span>
  (<span style="font-weight: bold;">setq</span> yas-snippet-dirs '(<span style="font-style: italic;">"~/.emacs.d/snippets"</span>))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Reload all snippets</span>
  (yas-reload-all)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable yasnippet minor mode in programming modes</span>
  (add-hook 'prog-mode-hook #'yas-minor-mode))

</pre>
</div>
</div>
</div>

<div id="outline-container-org6f1096f" class="outline-3">
<h3 id="org6f1096f">Markdown Settings</h3>
<div class="outline-text-3" id="text-org6f1096f">
<p>
This Emacs Lisp code block is used to install and configure the markdown-mode package in Emacs. It sets up Emacs to automatically use GitHub Flavored Markdown mode (gfm-mode) when opening files with .markdown or .md extensions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use markdown-mode package</span>
(use-package markdown-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add .markdown and .md files to auto-mode-alist for gfm-mode (GitHub Flavored Markdown mode)</span>
  (add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.markdown"</span> . gfm-mode))
  (add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.md"</span> . gfm-mode)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org5d95754" class="outline-3">
<h3 id="org5d95754">JSON Settings</h3>
<div class="outline-text-3" id="text-org5d95754">
<p>
This Emacs Lisp code block is used to install and configure the json-mode package in Emacs. It ensures that any file with a .json extension will automatically open in json-mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use json-mode package</span>
(use-package json-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add .json files to auto-mode-alist for json-mode</span>
  (add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.json"</span> . json-mode)))

</pre>
</div>
</div>
</div>
