skeleton_files/emacs_config.org
** LaTeX Settings

This Emacs Lisp code block serves to streamline the installation and configuration of several packages designed to enhance LaTeX editing within Emacs. First and foremost, 'auctex' is configured to improve LaTeX support by setting options, enabling useful modes like prettify symbols and flyspell, and integrating 'reftex.' Additionally, 'auto-complete-auctex' offers auto-completion features tailored for AUCTeX. 'cdlatex' is set up to provide efficient input methods for LaTeX environments and math, and 'pdf-tools' is configured as a comprehensive in-Emacs PDF viewer with lazy loading. Although 'latex-preview-pane' is included, its use is commented out, as it enables LaTeX file preview directly within Emacs and can be easily activated by uncommenting the relevant configuration lines. These configurations collectively optimize the LaTeX editing experience in Emacs.

#+BEGIN_SRC emacs-lisp

;; Use auctex package
(use-package auctex
  :ensure t
  :hook 
  ;; Enable prettify symbols mode and flyspell in LaTeX mode
  (LaTeX-mode . turn-on-prettify-symbols-mode)
  (LaTeX-mode . turn-on-flyspell)
  :config
  ;; Set various options for auctex
  (setq TeX-auto-save t
        TeX-parse-self t
        TeX-save-query nil
        TeX-master nil
        TeX-engine 'pdflatex ; 'xetex, 'pdflatex, 'lualatex, etc., depending on your preference
        TeX-PDF-mode t)
  ;; Set newline function for auctex
  (TeX-newline-function 'newline-and-indent)
  ;; Add hook to enable reftex in LaTeX mode
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex))

;; Use auto-complete-auctex package after auctex
(use-package auto-complete-auctex
  :ensure t
  :after auctex)

;; Use biblio package
(use-package biblio
  :ensure t)

;; Use cdlatex package
(use-package cdlatex
  :ensure t
  :config
  ;; Enable cdlatex in LaTeX mode
  (add-hook 'LaTeX-mode-hook #'turn-on-cdlatex))

;; Use pdf-tools package
(use-package pdf-tools
  :ensure t
  :defer t)

;; Uncomment the following lines if you want to use latex-preview-pane package
;;(use-package latex-preview-pane
;;  :ensure t
;;  :config
;;  ;; Enable latex preview pane mode in LaTeX mode
;;  (add-hook 'LaTeX-mode-hook #'latex-preview-pane-mode))

#+END_SRC

