emacs_config.html

<div id="outline-container-orga53765d" class="outline-3">
<h3 id="orga53765d">LaTeX Settings</h3>
<div class="outline-text-3" id="text-orga53765d">
<p>
This Emacs Lisp code block serves to streamline the installation and configuration of several packages designed to enhance LaTeX editing within Emacs. First and foremost, 'auctex' is configured to improve LaTeX support by setting options, enabling useful modes like prettify symbols and flyspell, and integrating 'reftex.' Additionally, 'auto-complete-auctex' offers auto-completion features tailored for AUCTeX. 'cdlatex' is set up to provide efficient input methods for LaTeX environments and math, and 'pdf-tools' is configured as a comprehensive in-Emacs PDF viewer with lazy loading. Although 'latex-preview-pane' is included, its use is commented out, as it enables LaTeX file preview directly within Emacs and can be easily activated by uncommenting the relevant configuration lines. These configurations collectively optimize the LaTeX editing experience in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use auctex package</span>
(use-package auctex
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable prettify symbols mode and flyspell in LaTeX mode</span>
  (LaTeX-mode . turn-on-prettify-symbols-mode)
  (LaTeX-mode . turn-on-flyspell)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set various options for auctex</span>
  (<span style="font-weight: bold;">setq</span> TeX-auto-save t
        TeX-parse-self t
        TeX-save-query nil
        TeX-master nil
        TeX-engine 'pdflatex <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">'xetex, 'pdflatex, 'lualatex, etc., depending on your preference</span>
        TeX-PDF-mode t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set newline function for auctex</span>
  (TeX-newline-function 'newline-and-indent)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add hook to enable reftex in LaTeX mode</span>
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use auto-complete-auctex package after auctex</span>
(use-package auto-complete-auctex
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> auctex)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use biblio package</span>
(use-package biblio
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use cdlatex package</span>
(use-package cdlatex
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable cdlatex in LaTeX mode</span>
  (add-hook 'LaTeX-mode-hook #'turn-on-cdlatex))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use pdf-tools package</span>
(use-package pdf-tools
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:defer</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Uncomment the following lines if you want to use latex-preview-pane package</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(use-package latex-preview-pane</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">:ensure t</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">:config</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">;; Enable latex preview pane mode in LaTeX mode</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">(add-hook 'LaTeX-mode-hook #'latex-preview-pane-mode))</span>

</pre>
</div>
</div>
</div>
