skeleton_files/emacs_config.org
** Python Settings

This Emacs Lisp code block is dedicated to installing and configuring several packages to enhance Python programming within the Emacs environment. It covers a range of functionalities, starting with 'python-mode,' which enhances Python language editing and includes configurations for 'lsp-deferred,' Python shell interpreter, and 'dap-python' options. 'ein' enables interaction with Jupyter notebooks in Emacs, with various options configured. 'python-pytest' facilitates pytest usage, confirming before running tests. 'py-isort' integrates the 'isort' tool for sorting imports, 'pyimport' adds/removes import statements, 'poetry' provides an interface to Poetry for dependency management, and 'pipenv' interfaces with Pipenv, setting up pipenv mode and project handling. 'elpy' is enabled as an Emacs Python Development Environment. Although 'pyenv' is commented out, it offers an interface to Pyenv for Python version management when uncommented. These configurations collectively optimize Python development in Emacs.

We use =lsp-mode= and =dap-mode= to provide a complete development environment for Python in Emacs. Check out [[https://emacs-lsp.github.io/lsp-mode/page/lsp-pyls/][the =pyls= configuration]] in the =lsp-mode= documentation for more details.
=pip3 install "python-language-server[all]"=

#+BEGIN_SRC emacs-lisp

;; Use python-mode package
(use-package python-mode
  :ensure t
  :demand t
  :hook 
  ;; Enable lsp-deferred in python mode
  (python-mode . lsp-deferred)
  :custom
  ;; Set python shell interpreter and dap-python options
  (python-shell-interpreter "python3")
  (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  ;; Require dap-python
  (require 'dap-python))

;; Use ein package
(use-package ein
  :ensure t
  :config
  ;; Set various options for ein
  (setq ein:use-auto-complete t
        ein:use-smartrep t
        ein:jupyter-default-server-command "jupyter-notebook"))

;; Use python-pytest package
(use-package python-pytest
  :ensure t
  :custom 
  ;; Confirm before running pytest
  (python-pytest-confirm t))

;; Use py-isort package
(use-package py-isort
  :ensure t)

;; Use pyimport package
(use-package pyimport
  :ensure t)

;; Uncomment the following lines if you want to use pyenv package
;;(use-package pyenv
;;  :ensure t
;;  :elpaca (:host github :repo "shellbj/pyenv.el")
;;  :config 
;;  ;; Enable global pyenv mode
;;  (global-pyenv-mode))

;; Use poetry package
(use-package poetry
  :ensure t)

;; Use pipenv package
(use-package pipenv
  :ensure t
  :hook 
  ;; Enable pipenv mode in python mode
  (python-mode . pipenv-mode)
  :init 
  ;; Set pipenv projectile after switch function
  (setq pipenv-projectile-after-switch-function #'pipenv-projectile-after-switch-extended))

;; Use elpy package
(use-package elpy
  :ensure t
  :init 
  ;; Enable elpy
  (elpy-enable))

#+END_SRC

** Typescript Settings

This Emacs Lisp code block installs and configures the typescript-mode package in Emacs. It sets up Emacs to automatically use TypeScript mode for .ts files, enables on-demand loading of Language Server Protocol features, and sets the indentation level for TypeScript code to 4 spaces.

For =lsp-mode= to work with TypeScript (and JavaScript) you will need to install a language server on your machine. If you have Node.js installed, the easiest way to do that is by running the following command:
=npm install -g typescript-language-server= typescript

#+BEGIN_SRC emacs-lisp

;; Use typescript-mode package
(use-package typescript-mode
  :ensure t
  :mode "\\.ts\\'"
  :hook 
  ;; Enable lsp-deferred in typescript mode
  (typescript-mode . lsp-deferred)
  :config
  ;; Set indentation level for typescript
  (setq typescript-indent-level 4))

#+END_SRC

