emacs_config.html

<div id="outline-container-org5b2385c" class="outline-3">
<h3 id="org5b2385c">Python Settings</h3>
<div class="outline-text-3" id="text-org5b2385c">
<p>
This Emacs Lisp code block is dedicated to installing and configuring several packages to enhance Python programming within the Emacs environment. It covers a range of functionalities, starting with 'python-mode,' which enhances Python language editing and includes configurations for 'lsp-deferred,' Python shell interpreter, and 'dap-python' options. 'ein' enables interaction with Jupyter notebooks in Emacs, with various options configured. 'python-pytest' facilitates pytest usage, confirming before running tests. 'py-isort' integrates the 'isort' tool for sorting imports, 'pyimport' adds/removes import statements, 'poetry' provides an interface to Poetry for dependency management, and 'pipenv' interfaces with Pipenv, setting up pipenv mode and project handling. 'elpy' is enabled as an Emacs Python Development Environment. Although 'pyenv' is commented out, it offers an interface to Pyenv for Python version management when uncommented. These configurations collectively optimize Python development in Emacs.
</p>

<p>
We use <code>lsp-mode</code> and <code>dap-mode</code> to provide a complete development environment for Python in Emacs. Check out <a href="https://emacs-lsp.github.io/lsp-mode/page/lsp-pyls/">the <code>pyls</code> configuration</a> in the <code>lsp-mode</code> documentation for more details.
<code>pip3 install "python-language-server[all]"</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use python-mode package</span>
(use-package python-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:demand</span> t
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable lsp-deferred in python mode</span>
  (python-mode . lsp-deferred)
  <span style="font-weight: bold;">:custom</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set python shell interpreter and dap-python options</span>
  (python-shell-interpreter <span style="font-style: italic;">"python3"</span>)
  (dap-python-executable <span style="font-style: italic;">"python3"</span>)
  (dap-python-debugger 'debugpy)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Require dap-python</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">dap-python</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use ein package</span>
(use-package ein
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set various options for ein</span>
  (<span style="font-weight: bold;">setq</span> ein:use-auto-complete t
        ein:use-smartrep t
        ein:jupyter-default-server-command <span style="font-style: italic;">"jupyter-notebook"</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use python-pytest package</span>
(use-package python-pytest
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:custom</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Confirm before running pytest</span>
  (python-pytest-confirm t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use py-isort package</span>
(use-package py-isort
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use pyimport package</span>
(use-package pyimport
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Uncomment the following lines if you want to use pyenv package</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(use-package pyenv</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">:ensure t</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">:elpaca (:host github :repo "shellbj/pyenv.el")</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">:config </span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">;; Enable global pyenv mode</span>
<span style="font-weight: bold; font-style: italic;">;;  </span><span style="font-weight: bold; font-style: italic;">(global-pyenv-mode))</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use poetry package</span>
(use-package poetry
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use pipenv package</span>
(use-package pipenv
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable pipenv mode in python mode</span>
  (python-mode . pipenv-mode)
  <span style="font-weight: bold;">:init</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set pipenv projectile after switch function</span>
  (<span style="font-weight: bold;">setq</span> pipenv-projectile-after-switch-function #'pipenv-projectile-after-switch-extended))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use elpy package</span>
(use-package elpy
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable elpy</span>
  (elpy-enable))

</pre>
</div>
</div>
</div>

<div id="outline-container-org1eea246" class="outline-3">
<h3 id="org1eea246">Typescript Settings</h3>
<div class="outline-text-3" id="text-org1eea246">
<p>
This Emacs Lisp code block installs and configures the typescript-mode package in Emacs. It sets up Emacs to automatically use TypeScript mode for .ts files, enables on-demand loading of Language Server Protocol features, and sets the indentation level for TypeScript code to 4 spaces.
</p>

<p>
For <code>lsp-mode</code> to work with TypeScript (and JavaScript) you will need to install a language server on your machine. If you have Node.js installed, the easiest way to do that is by running the following command:
<code>npm install -g typescript-language-server</code> typescript
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use typescript-mode package</span>
(use-package typescript-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:mode</span> <span style="font-style: italic;">"\\.ts\\'"</span>
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable lsp-deferred in typescript mode</span>
  (typescript-mode . lsp-deferred)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set indentation level for typescript</span>
  (<span style="font-weight: bold;">setq</span> typescript-indent-level 4))

</pre>
</div>
</div>
</div>
