skeleton_files/emacs_config.org
** Verilog-Mode Settings


This Emacs Lisp code block configures and ensures the installation of the 'verilog-mode' and 'verilog-ext' packages for improved support in Emacs when working with Verilog files. 'verilog-ext' is set up to work in conjunction with 'verilog-mode' and is configured with various features like syntax highlighting, cross-referencing, code completion, hierarchy navigation, language server support (using ve-svlangserver), linting with flycheck, code beautification, and more. Additionally, it defines the indexing function for imenu and specifies certain backend and frontend options for hierarchy and tags handling. Note that there's also a commented-out section for 'verilog-ts-mode' if you wish to use it. These configurations aim to enhance the Verilog development experience in Emacs.

#+BEGIN_SRC emacs-lisp

;; Use verilog-mode package
(use-package verilog-mode
  :ensure t)

;; Use verilog-ext package after verilog-mode
(use-package verilog-ext
  :ensure t
  :after verilog-mode
  :demand
  :hook 
  ;; Enable verilog-ext mode in verilog mode
  (verilog-mode . verilog-ext-mode)
  :init
  ;; Set features for verilog-ext
  (setq verilog-ext-feature-list '( font-lock
                                    xref
                                    capf
                                    hierarchy
                                    eglot
                                    lsp
                                    flycheck
                                    beautify
                                    navigation
                                    template
                                    formatter
                                    compilation
                                    imenu
                                    which-func
                                    hideshow
                                    typedefs
                                    time-stamp
                                    block-end-comments
                                    company-keywords
                                    ports))
  :config
  ;; Setup verilog-ext mode and set various options
  (verilog-ext-mode-setup)
  (verilog-ext-lsp-set-server 've-svlangserver)
  (setq verilog-ext-hierarchy-backend 'builtin)
  (setq verilog-ext-hierarchy-frontend 'hierarchy)
  (setq verilog-ext-tags-backend 'tree-sitter)
  (setq-local imenu-create-index-function #'verilog-ext-imenu-index))

;; Uncomment the following lines if you want to use verilog-ts-mode package
;;(use-package verilog-ts-mode
;;	:mode (("\\.s?vh?\\'" . verilog-ts-mode)))

#+END_SRC

** Emacs Lisp Settings

This Emacs Lisp code block sets up a hook for the 'emacs-lisp-mode,' which is used for editing Emacs Lisp code. When in 'emacs-lisp-mode,' the script enables 'eldoc-mode' to provide helpful documentation about functions and variables in the Emacs Lisp code you're writing. It also defines a key binding within 'emacs-lisp-mode'—pressing Ctrl-c Ctrl-c ('C-c C-c') triggers the 'byte-recompile-directory' function, which recompiles all .el files in the current directory. This setup enhances the development experience when working with Emacs Lisp code by providing real-time documentation assistance and a convenient key binding for recompilation.

#+BEGIN_SRC emacs-lisp

;; Add hook for emacs-lisp-mode
(add-hook 'emacs-lisp-mode-hook 
  (lambda ()
    ;; Enable eldoc mode in emacs-lisp-mode
    (eldoc-mode 1)
    ;; Define key binding for byte-recompile-directory in emacs-lisp-mode
    (define-key (current-local-map) "\C-c\C-c" 'byte-recompile-directory)))

#+END_SRC

** YAML Settings

This block of code installs the *yaml-mode* package in Emacs, but defers its loading until it's needed. The *yaml-mode* package offers an environment for editing YAML files.

#+BEGIN_SRC emacs-lisp

;; Use yaml-mode package
(use-package yaml-mode
  :ensure t
  :defer t)

#+END_SRC

** Scala Settings

This block of code installs the *scala-mode* package in Emacs. The *scala-mode* package offers an environment for editing Scala files.

#+BEGIN_SRC emacs-lisp

;; Use scala-mode package
(use-package scala-mode
  :ensure t)

#+END_SRC

