emacs_config.html

<div id="outline-container-org3067956" class="outline-3">
<h3 id="org3067956">Verilog-Mode Settings</h3>
<div class="outline-text-3" id="text-org3067956">
<p>
This Emacs Lisp code block configures and ensures the installation of the 'verilog-mode' and 'verilog-ext' packages for improved support in Emacs when working with Verilog files. 'verilog-ext' is set up to work in conjunction with 'verilog-mode' and is configured with various features like syntax highlighting, cross-referencing, code completion, hierarchy navigation, language server support (using ve-svlangserver), linting with flycheck, code beautification, and more. Additionally, it defines the indexing function for imenu and specifies certain backend and frontend options for hierarchy and tags handling. Note that there's also a commented-out section for 'verilog-ts-mode' if you wish to use it. These configurations aim to enhance the Verilog development experience in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use verilog-mode package</span>
(use-package verilog-mode
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use verilog-ext package after verilog-mode</span>
(use-package verilog-ext
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> verilog-mode
  <span style="font-weight: bold;">:demand</span>
  <span style="font-weight: bold;">:hook</span> 
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable verilog-ext mode in verilog mode</span>
  (verilog-mode . verilog-ext-mode)
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set features for verilog-ext</span>
  (<span style="font-weight: bold;">setq</span> verilog-ext-feature-list '( font-lock
                                    xref
                                    capf
                                    hierarchy
                                    eglot
                                    lsp
                                    flycheck
                                    beautify
                                    navigation
                                    template
                                    formatter
                                    compilation
                                    imenu
                                    which-func
                                    hideshow
                                    typedefs
                                    time-stamp
                                    block-end-comments
                                    company-keywords
                                    ports))
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setup verilog-ext mode and set various options</span>
  (verilog-ext-mode-setup)
  (verilog-ext-lsp-set-server 've-svlangserver)
  (<span style="font-weight: bold;">setq</span> verilog-ext-hierarchy-backend 'builtin)
  (<span style="font-weight: bold;">setq</span> verilog-ext-hierarchy-frontend 'hierarchy)
  (<span style="font-weight: bold;">setq</span> verilog-ext-tags-backend 'tree-sitter)
  (<span style="font-weight: bold;">setq-local</span> imenu-create-index-function #'verilog-ext-imenu-index))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Uncomment the following lines if you want to use verilog-ts-mode package</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(use-package verilog-ts-mode</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">      :mode (("\\.s?vh?\\'" . verilog-ts-mode)))</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org9b90441" class="outline-3">
<h3 id="org9b90441">Emacs Lisp Settings</h3>
<div class="outline-text-3" id="text-org9b90441">
<p>
This Emacs Lisp code block sets up a hook for the 'emacs-lisp-mode,' which is used for editing Emacs Lisp code. When in 'emacs-lisp-mode,' the script enables 'eldoc-mode' to provide helpful documentation about functions and variables in the Emacs Lisp code you're writing. It also defines a key binding within 'emacs-lisp-mode'pressing Ctrl-c Ctrl-c ('C-c C-c') triggers the 'byte-recompile-directory' function, which recompiles all .el files in the current directory. This setup enhances the development experience when working with Emacs Lisp code by providing real-time documentation assistance and a convenient key binding for recompilation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add hook for emacs-lisp-mode</span>
(add-hook 'emacs-lisp-mode-hook 
  (<span style="font-weight: bold;">lambda</span> ()
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable eldoc mode in emacs-lisp-mode</span>
    (eldoc-mode 1)
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define key binding for byte-recompile-directory in emacs-lisp-mode</span>
    (define-key (current-local-map) <span style="font-style: italic;">"\C-c\C-c"</span> 'byte-recompile-directory)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org6f21902" class="outline-3">
<h3 id="org6f21902">YAML Settings</h3>
<div class="outline-text-3" id="text-org6f21902">
<p>
This block of code installs the <b>yaml-mode</b> package in Emacs, but defers its loading until it's needed. The <b>yaml-mode</b> package offers an environment for editing YAML files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use yaml-mode package</span>
(use-package yaml-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:defer</span> t)

</pre>
</div>
</div>
</div>

<div id="outline-container-orga860f7e" class="outline-3">
<h3 id="orga860f7e">Scala Settings</h3>
<div class="outline-text-3" id="text-orga860f7e">
<p>
This block of code installs the <b>scala-mode</b> package in Emacs. The <b>scala-mode</b> package offers an environment for editing Scala files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use scala-mode package</span>
(use-package scala-mode
  <span style="font-weight: bold;">:ensure</span> t)

</pre>
</div>
</div>
</div>
