skeleton_files/emacs_config.org
** ORG Settings

This Emacs Lisp code block is dedicated to optimizing the functionality and appearance of Org Mode within Emacs. It begins by requiring 'org-tempo' for expanding Org templates and then sets up 'toc-org' and 'org-bullets' packages to enable a table of contents and improve bullet point presentation, respectively. Various hooks are added to 'org-mode' to enable 'org-indent-mode,' activate 'org-bullets-mode,' and customize the behavior of angle bracket auto-pairing. The code block also fine-tunes indentation, customizes todo keyword faces and emphasis markers, configures Org Babel languages, and customizes the appearance of different outline levels. It additionally includes 'org-ref' for reference management and 'org-alert' for alert notifications, though 'org-ref' is disabled due to slow loading. Collectively, these configurations enhance the usability and aesthetics of Org Mode for task management and document organization in Emacs.

| Typing the below + TAB | Expands to                              |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

#+BEGIN_SRC emacs-lisp

;; Require org-tempo package
(require 'org-tempo)

;; Use toc-org package
(use-package toc-org
  :ensure t
  :commands toc-org-enable
  :init
  ;; Enable toc-org in org mode
  (add-hook 'org-mode-hook 'toc-org-enable))

;; Use org-bullets package
(use-package org-bullets
  :ensure t)

;; Add hooks for org mode
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(add-hook 'org-mode-hook (lambda () (org-indent-mode) (diminish 'org-indent-mode)))

;; Set src block automatic indent to 2.
(setq org-edit-src-content-indentation 2)

;; Prevent <> from auto-pairing when electric-pair-mode is on.
(add-hook 'org-mode-hook 
          (lambda () 
            (setq-local electric-pair-inhibit-predicate `(lambda (c) 
                                                           (if (char-equal c ?<) t 
                                                             (,electric-pair-inhibit-predicate c))))))

;; Set faces for org todo keywords
(setq org-todo-keyword-faces
      '(("TODO" :foreground "red" :weight bold)
        ("NEXT" :foreground "blue" :weight bold)
        ("DONE" :foreground "forest green" :weight bold)
        ("WAITING" :foreground "orange" :weight bold)
        ("HOLD" :foreground "magenta" :weight bold)
        ("CANCELLED" :foreground "forest green" :weight bold)
        ("MEETING" :foreground "forest green" :weight bold)
        ("PHONE" :foreground "forest green" :weight bold)))

;; Set org export with todo keywords to nil
(setq-default org-export-with-todo-keywords nil)

;; Hide emphasis markers in org mode
(setq org-hide-emphasis-markers t)

;; Load languages for org babel after loading org
(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))
  ;; Add conf-unix to org src lang modes
  (push '("conf-unix" . conf-unix) org-src-lang-modes))

;; Set faces for org levels
(custom-set-faces
 '(org-level-1 ((t (:inherit outline-1 :height 1.6))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.5))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.4))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.3))))
 '(org-level-5 ((t (:inherit outline-5 :height 1.2))))
 '(org-level-6 ((t (:inherit outline-5 :height 1.1))))
 '(org-level-7 ((t (:inherit outline-5 :height 1.0)))))

;; Use org-ref package
(use-package org-ref
  :ensure t
  :disabled ;; very slow to load
  :config
  ;; Alias dnd-unescape-uri to dnd--unescape-uri
  (defalias 'dnd-unescape-uri 'dnd--unescape-uri))

;; Use org-alert package
(use-package org-alert
  :ensure t
  :config
  ;; Enable org alert
  (org-alert-enable)
  :custom
  ;; Set default style for alerts
  (alert-default-style 'osx-notifier))

#+END_SRC

