emacs_config.html

<div id="outline-container-org6bc37dd" class="outline-3">
<h3 id="org6bc37dd">ORG Settings</h3>
<div class="outline-text-3" id="text-org6bc37dd">
<p>
This Emacs Lisp code block is dedicated to optimizing the functionality and appearance of Org Mode within Emacs. It begins by requiring 'org-tempo' for expanding Org templates and then sets up 'toc-org' and 'org-bullets' packages to enable a table of contents and improve bullet point presentation, respectively. Various hooks are added to 'org-mode' to enable 'org-indent-mode,' activate 'org-bullets-mode,' and customize the behavior of angle bracket auto-pairing. The code block also fine-tunes indentation, customizes todo keyword faces and emphasis markers, configures Org Babel languages, and customizes the appearance of different outline levels. It additionally includes 'org-ref' for reference management and 'org-alert' for alert notifications, though 'org-ref' is disabled due to slow loading. Collectively, these configurations enhance the usability and aesthetics of Org Mode for task management and document organization in Emacs.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Typing the below + TAB</th>
<th scope="col" class="org-left">Expands to</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;a</td>
<td class="org-left">'#+BEGIN<sub>EXPORT</sub> ascii'  '#+END<sub>EXPORT</sub></td>
</tr>

<tr>
<td class="org-left">&lt;c</td>
<td class="org-left">'#+BEGIN<sub>CENTER</sub>'  '#+END<sub>CENTER</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;C</td>
<td class="org-left">'#+BEGIN<sub>COMMENT</sub>'  '#+END<sub>COMMENT</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;e</td>
<td class="org-left">'#+BEGIN<sub>EXAMPLE</sub>'  '#+END<sub>EXAMPLE</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;E</td>
<td class="org-left">'#+BEGIN<sub>EXPORT</sub>'  '#+END<sub>EXPORT</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;h</td>
<td class="org-left">'#+BEGIN<sub>EXPORT</sub> html'  '#+END<sub>EXPORT</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;l</td>
<td class="org-left">'#+BEGIN<sub>EXPORT</sub> latex'  '#+END<sub>EXPORT</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;q</td>
<td class="org-left">'#+BEGIN<sub>QUOTE</sub>'  '#+END<sub>QUOTE</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;s</td>
<td class="org-left">'#+BEGIN<sub>SRC</sub>'  '#+END<sub>SRC</sub>'</td>
</tr>

<tr>
<td class="org-left">&lt;v</td>
<td class="org-left">'#+BEGIN<sub>VERSE</sub>'  '#+END<sub>VERSE</sub>'</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Require org-tempo package</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-tempo</span>)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use toc-org package</span>
(use-package toc-org
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:commands</span> toc-org-enable
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable toc-org in org mode</span>
  (add-hook 'org-mode-hook 'toc-org-enable))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use org-bullets package</span>
(use-package org-bullets
  <span style="font-weight: bold;">:ensure</span> t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add hooks for org mode</span>
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> () (org-bullets-mode 1)))
(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> () (org-indent-mode) (diminish 'org-indent-mode)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set src block automatic indent to 2.</span>
(<span style="font-weight: bold;">setq</span> org-edit-src-content-indentation 2)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Prevent &lt;&gt; from auto-pairing when electric-pair-mode is on.</span>
(add-hook 'org-mode-hook 
          (<span style="font-weight: bold;">lambda</span> () 
            (<span style="font-weight: bold;">setq-local</span> electric-pair-inhibit-predicate `(<span style="font-weight: bold;">lambda</span> (c) 
                                                           (<span style="font-weight: bold;">if</span> (char-equal c ?&lt;) t 
                                                             (,electric-pair-inhibit-predicate c))))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set faces for org todo keywords</span>
(<span style="font-weight: bold;">setq</span> org-todo-keyword-faces
      '((<span style="font-style: italic;">"TODO"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"red"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"NEXT"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"blue"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"DONE"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"forest green"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"WAITING"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"orange"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"HOLD"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"magenta"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"CANCELLED"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"forest green"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"MEETING"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"forest green"</span> <span style="font-weight: bold;">:weight</span> bold)
        (<span style="font-style: italic;">"PHONE"</span> <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"forest green"</span> <span style="font-weight: bold;">:weight</span> bold)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set org export with todo keywords to nil</span>
(<span style="font-weight: bold;">setq-default</span> org-export-with-todo-keywords nil)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Hide emphasis markers in org mode</span>
(<span style="font-weight: bold;">setq</span> org-hide-emphasis-markers t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load languages for org babel after loading org</span>
(<span style="font-weight: bold;">with-eval-after-load</span> 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add conf-unix to org src lang modes</span>
  (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"conf-unix"</span> . conf-unix) org-src-lang-modes))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set faces for org levels</span>
(custom-set-faces
 '(org-level-1 ((t (<span style="font-weight: bold;">:inherit</span> outline-1 <span style="font-weight: bold;">:height</span> 1.6))))
 '(org-level-2 ((t (<span style="font-weight: bold;">:inherit</span> outline-2 <span style="font-weight: bold;">:height</span> 1.5))))
 '(org-level-3 ((t (<span style="font-weight: bold;">:inherit</span> outline-3 <span style="font-weight: bold;">:height</span> 1.4))))
 '(org-level-4 ((t (<span style="font-weight: bold;">:inherit</span> outline-4 <span style="font-weight: bold;">:height</span> 1.3))))
 '(org-level-5 ((t (<span style="font-weight: bold;">:inherit</span> outline-5 <span style="font-weight: bold;">:height</span> 1.2))))
 '(org-level-6 ((t (<span style="font-weight: bold;">:inherit</span> outline-5 <span style="font-weight: bold;">:height</span> 1.1))))
 '(org-level-7 ((t (<span style="font-weight: bold;">:inherit</span> outline-5 <span style="font-weight: bold;">:height</span> 1.0)))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use org-ref package</span>
(use-package org-ref
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:disabled</span> <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">very slow to load</span>
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Alias dnd-unescape-uri to dnd--unescape-uri</span>
  (<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">dnd-unescape-uri</span> 'dnd--unescape-uri))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use org-alert package</span>
(use-package org-alert
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable org alert</span>
  (org-alert-enable)
  <span style="font-weight: bold;">:custom</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set default style for alerts</span>
  (alert-default-style 'osx-notifier))

</pre>
</div>
</div>
</div>
</div>
