skeleton_files/emacs_config.org
* Miscellaneous Packages

This Emacs Lisp code block configures several packages to enhance various aspects of the Emacs environment. It begins by enabling 'sudo-edit' for editing files with sudo privileges and 'tldr' for quick access to command documentation. 'smartparens' is configured globally to improve code pairing and navigation, while 'apheleia' enables automatic code formatting. 'csv-mode' is set up to guess and set separators for CSV files automatically. 'emojify' replaces text-based emojis with graphical representations in a global mode. 'format-all' facilitates code formatting in programming modes, 'adaptive-wrap' improves text wrapping, 'simple-httpd' enables local website hosting, and 'htmlize' adds source block highlighting when publishing a website. Together, these configurations enhance productivity, code editing, and documentation lookup in Emacs.

#+BEGIN_SRC emacs-lisp

;; Use sudo-edit package
(use-package sudo-edit
  :ensure t)

;; Use tldr package
(use-package tldr
  :ensure t)

;; Use smartparens package
(use-package smartparens
  :ensure t
  :config
  ;; Require smartparens-config and enable global mode
  (require 'smartparens-config)
  (smartparens-global-mode t))

;; Use apheleia package
(use-package apheleia
  :ensure t
  :config
  ;; Enable apheleia global mode
  (apheleia-global-mode +1))

;; Use csv-mode package
(use-package csv-mode
  :ensure t
  :config
  ;; Add hook to set separator in csv mode
  (add-hook 'csv-mode-hook 'csv-guess-set-separator))

;; Use emojify package
(use-package emojify
  :ensure t
  :hook 
  ;; Enable global emojify mode after init
  (after-init . global-emojify-mode))

;; Use format-all package
(use-package format-all
  :ensure t
  :config
  ;; Enable format all mode in prog mode
  (add-hook 'prog-mode-hook 'format-all-mode))

;; Use adaptive-wrap package
(use-package adaptive-wrap
  :ensure t)

;; Host your website on your local machine
(use-package simple-httpd
  :ensure t)

;; Enable fontify of source blocks while publishing a website
(use-package htmlize
  :ensure t)

#+END_SRC

