skeleton_files/emacs_config.org
* List of all Keybindings

| Keybinding      | Command                             | Defined With          |
|-----------------+-------------------------------------+-----------------------|
| SPC SPC         | counsel-M-x                         | general.el            |
| SPC .           | find-file                           | general.el            |
| SPC =           | perspective-map                     | general.el            |
| SPC TAB TAB     | comment-line                        | general.el            |
| SPC u           | universal-argument                  | general.el            |
| SPC b b         | switch-to-buffer                    | general.el            |
| SPC b c         | clone-indirect-buffer               | general.el            |
| SPC b C         | clone-indirect-buffer-other-window  | general.el            |
| SPC b d         | bookmark-delete                     | general.el            |
| SPC b i         | ibuffer                             | general.el            |
| SPC b k         | kill-current-buffer                 | general.el            |
| SPC b K         | kill-some-buffers                   | general.el            |
| SPC b l         | list-bookmarks                      | general.el            |
| SPC b m         | bookmark-set                        | general.el            |
| SPC b n         | next-buffer                         | general.el            |
| SPC b p         | previous-buffer                     | general.el            |
| SPC b r         | revert-buffer                       | general.el            |
| SPC b R         | rename-buffer                       | general.el            |
| SPC b s         | basic-save-buffer                   | general.el            |
| SPC b S         | save-some-buffers                   | general.el            |
| SPC b w         | bookmark-save                       | general.el            |
| SPC d d         | dired                               | general.el            |
| SPC d j         | dired-jump                          | general.el            |
| SPC d n         | neotree-dir                         | general.el            |
| SPC d p         | peep-dired                          | general.el            |
| SPC e b         | eval-buffer                         | general.el            |
| SPC e d         | eval-defun                          | general.el            |
| SPC e e         | eval-expression                     | general.el            |
| SPC e h         | counsel-esh-history                 | general.el            |
| SPC e l         | eval-last-sexp                      | general.el            |
| SPC e r         | eval-region                         | general.el            |
| SPC e R         | eww-reload                          | general.el            |
| SPC e s         | eshell                              | general.el            |
| SPC e w         | eww                                 | general.el            |
| SPC f c         | Open emacs_config.org               | general.el            |
| SPC f e         | Open ~/.emacs.d/ in dired           | general.el            |
| SPC f d         | find-grep-dired                     | general.el            |
| SPC f g         | counsel-grep-or-swiper              | general.el            |
| SPC f i         | Open init.el                        | general.el            |
| SPC f j         | counsel-file-jump                   | general.el            |
| SPC f l         | counsel-locate                      | general.el            |
| SPC f r         | counsel-recentf                     | general.el            |
| SPC f u         | sudo-edit-find-file                 | general.el            |
| SPC f U         | sudo-edit                           | general.el            |
| SPC g /         | magit-dispatch                      | general.el            |
| SPC g .         | magit-file-dispatch                 | general.el            |
| SPC g b         | magit-branch-checkout               | general.el            |
| SPC g c b       | magit-branch-and-checkout           | general.el            |
| SPC g c c       | magit-commit-create                 | general.el            |
| SPC g c f       | magit-commit-fixup                  | general.el            |
| SPC g C         | magit-clone                         | general.el            |
| SPC g f c       | magit-show-commit                   | general.el            |
| SPC g f f       | magit-find-file                     | general.el            |
| SPC g f g       | magit-find-git-config-file          | general.el            |
| SPC g F         | magit-fetch                         | general.el            |
| SPC g g         | magit-status                        | general.el            |
| SPC g i         | magit-init                          | general.el            |
| SPC g l         | magit-log-buffer-file               | general.el            |
| SPC g r         | vc-revert                           | general.el            |
| SPC g s         | magit-stage-file                    | general.el            |
| SPC g t         | git-timemachine                     | general.el            |
| SPC g u         | magit-stage-file                    | general.el            |
| SPC h a         | counsel-apropos                     | general.el            |
| SPC h b         | describe-bindings                   | general.el            |
| SPC h c         | describe-char                       | general.el            |
| SPC h d a       | about-emacs                         | general.el            |
| SPC h d d       | view-emacs-debugging                | general.el            |
| SPC h d f       | view-emacs-FAQ                      | general.el            |
| SPC h d m       | info-emacs-manual                   | general.el            |
| SPC h d n       | view-emacs-news                     | general.el            |
| SPC h d o       | describe-distribution               | general.el            |
| SPC h d p       | view-emacs-problems                 | general.el            |
| SPC h d t       | view-emacs-todo                     | general.el            |
| SPC h d w       | describe-no-warranty                | general.el            |
| SPC h e         | view-echo-area-messages             | general.el            |
| SPC h f         | describe-function                   | general.el            |
| SPC h F         | describe-face                       | general.el            |
| SPC h g         | describe-gnu-project                | general.el            |
| SPC h i         | info                                | general.el            |
| SPC h I         | describe-input-method               | general.el            |
| SPC h k         | describe-key                        | general.el            |
| SPC h l         | view-lossage                        | general.el            |
| SPC h L         | describe-language-environment       | general.el            |
| SPC h m         | describe-mode                       | general.el            |
| SPC h r r       | Reload emacs config                 | general.el            |
| SPC h t         | load-theme                          | general.el            |
| SPC h v         | describe-variable                   | general.el            |
| SPC h w         | where-is                            | general.el            |
| SPC h x         | describe-command                    | general.el            |
| SPC m a         | org-agenda                          | general.el            |
| SPC m e         | org-export-dispatch                 | general.el            |
| SPC m i         | org-toggle-item                     | general.el            |
| SPC m t         | org-todo                            | general.el            |
| SPC m B         | org-babel-tangle                    | general.el            |
| SPC m T         | org-todo-list                       | general.el            |
| SPC n r f       | neotree-refresh                     | general.el            |
| SPC n c e       | neotree-create-mode                 | general.el            |
| SPC n d n       | neotree-delete-mode                 | general.el            |
| SPC n r n       | neotree-rename-mode                 | general.el            |
| SPC m b -       | org-table-insert-hline              | general.el            |
| SPC m d t       | org-time-stamp                      | general.el            |
| SPC o d         | dashboard-open                      | general.el            |
| SPC o f         | make-frame                          | general.el            |
| SPC o F         | select-frame-by-name                | general.el            |
| SPC p           | projectile-command-map              | general.el            |
| SPC s d         | dictionary-search                   | general.el            |
| SPC s m         | man                                 | general.el            |
| SPC s t         | tldr                                | general.el            |
| SPC s w         | woman                               | general.el            |
| SPC t e         | eshell-toggle                       | general.el            |  
| SPC t f         | flycheck-mode                       | general.el            |
| SPC t l         | display-line-numbers-mode           | general.el            |
| SPC t n         | neotree-toggle                      | general.el            |
| SPC t o         | org-mode                            | general.el            |
| SPC t r         | rainbow-mode                        | general.el            |
| SPC t t         | visual-line-mode                    | general.el            |
| SPC t v         | vterm-toggle                        | general.el            |
| SPC w c         | evil-window-delete                  | general.el            |  
| SPC w n         | evil-window-new                     | general.el            |
| SPC w s         | evil-window-split                   | general.el            |
| SPC w v         | evil-window-vsplit                  | general.el            |
| SPC w h         | evil-window-left                    | general.el            |
| SPC w j         | evil-window-down                    | general.el            |
| SPC w k         | evil-window-up                      | general.el            |
| SPC w l         | evil-window-right                   | general.el            |
| SPC w w         | evil-window-next                    | general.el            |   
| SPC w H         | buf-move-left                       | general.el            |
| SPC w J         | buf-move-down                       | general.el            |
| SPC w K         | buf-move-up                         | general.el            |
| SPC w L         | buf-move-right                      | general.el            |
| C-S-a           | embark-act                          | :bind in embark       |
| C-h B           | embark-bindings                     | :bind in embark       |
| !               | consult-flycheck                    | flycheck-command-map  |
| M-/             | evilnc-comment-or-uncomment-lines   | global-set-key        |

