emacs_config.html

<div id="outline-container-org6b6eeeb" class="outline-2">
<h2 id="org6b6eeeb">List of all Keybindings</h2>
<div class="outline-text-2" id="text-org6b6eeeb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Defined With</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC SPC</td>
<td class="org-left">counsel-M-x</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC .</td>
<td class="org-left">find-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC =</td>
<td class="org-left">perspective-map</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC TAB TAB</td>
<td class="org-left">comment-line</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC u</td>
<td class="org-left">universal-argument</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b b</td>
<td class="org-left">switch-to-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b c</td>
<td class="org-left">clone-indirect-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b C</td>
<td class="org-left">clone-indirect-buffer-other-window</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b d</td>
<td class="org-left">bookmark-delete</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b i</td>
<td class="org-left">ibuffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b k</td>
<td class="org-left">kill-current-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b K</td>
<td class="org-left">kill-some-buffers</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b l</td>
<td class="org-left">list-bookmarks</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b m</td>
<td class="org-left">bookmark-set</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b n</td>
<td class="org-left">next-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b p</td>
<td class="org-left">previous-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b r</td>
<td class="org-left">revert-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b R</td>
<td class="org-left">rename-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b s</td>
<td class="org-left">basic-save-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b S</td>
<td class="org-left">save-some-buffers</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC b w</td>
<td class="org-left">bookmark-save</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC d d</td>
<td class="org-left">dired</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC d j</td>
<td class="org-left">dired-jump</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC d n</td>
<td class="org-left">neotree-dir</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC d p</td>
<td class="org-left">peep-dired</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e b</td>
<td class="org-left">eval-buffer</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e d</td>
<td class="org-left">eval-defun</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e e</td>
<td class="org-left">eval-expression</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e h</td>
<td class="org-left">counsel-esh-history</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e l</td>
<td class="org-left">eval-last-sexp</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e r</td>
<td class="org-left">eval-region</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e R</td>
<td class="org-left">eww-reload</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e s</td>
<td class="org-left">eshell</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC e w</td>
<td class="org-left">eww</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f c</td>
<td class="org-left">Open emacs<sub>config.org</sub></td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f e</td>
<td class="org-left">Open ~/.emacs.d/ in dired</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f d</td>
<td class="org-left">find-grep-dired</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f g</td>
<td class="org-left">counsel-grep-or-swiper</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f i</td>
<td class="org-left">Open init.el</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f j</td>
<td class="org-left">counsel-file-jump</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f l</td>
<td class="org-left">counsel-locate</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f r</td>
<td class="org-left">counsel-recentf</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f u</td>
<td class="org-left">sudo-edit-find-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC f U</td>
<td class="org-left">sudo-edit</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g /</td>
<td class="org-left">magit-dispatch</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g .</td>
<td class="org-left">magit-file-dispatch</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g b</td>
<td class="org-left">magit-branch-checkout</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g c b</td>
<td class="org-left">magit-branch-and-checkout</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g c c</td>
<td class="org-left">magit-commit-create</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g c f</td>
<td class="org-left">magit-commit-fixup</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g C</td>
<td class="org-left">magit-clone</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g f c</td>
<td class="org-left">magit-show-commit</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g f f</td>
<td class="org-left">magit-find-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g f g</td>
<td class="org-left">magit-find-git-config-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g F</td>
<td class="org-left">magit-fetch</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g g</td>
<td class="org-left">magit-status</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g i</td>
<td class="org-left">magit-init</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g l</td>
<td class="org-left">magit-log-buffer-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g r</td>
<td class="org-left">vc-revert</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g s</td>
<td class="org-left">magit-stage-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g t</td>
<td class="org-left">git-timemachine</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC g u</td>
<td class="org-left">magit-stage-file</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h a</td>
<td class="org-left">counsel-apropos</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h b</td>
<td class="org-left">describe-bindings</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h c</td>
<td class="org-left">describe-char</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d a</td>
<td class="org-left">about-emacs</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d d</td>
<td class="org-left">view-emacs-debugging</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d f</td>
<td class="org-left">view-emacs-FAQ</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d m</td>
<td class="org-left">info-emacs-manual</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d n</td>
<td class="org-left">view-emacs-news</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d o</td>
<td class="org-left">describe-distribution</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d p</td>
<td class="org-left">view-emacs-problems</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d t</td>
<td class="org-left">view-emacs-todo</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h d w</td>
<td class="org-left">describe-no-warranty</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h e</td>
<td class="org-left">view-echo-area-messages</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h f</td>
<td class="org-left">describe-function</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h F</td>
<td class="org-left">describe-face</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h g</td>
<td class="org-left">describe-gnu-project</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h i</td>
<td class="org-left">info</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h I</td>
<td class="org-left">describe-input-method</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h k</td>
<td class="org-left">describe-key</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h l</td>
<td class="org-left">view-lossage</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h L</td>
<td class="org-left">describe-language-environment</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h m</td>
<td class="org-left">describe-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h r r</td>
<td class="org-left">Reload emacs config</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h t</td>
<td class="org-left">load-theme</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h v</td>
<td class="org-left">describe-variable</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h w</td>
<td class="org-left">where-is</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC h x</td>
<td class="org-left">describe-command</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m a</td>
<td class="org-left">org-agenda</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m e</td>
<td class="org-left">org-export-dispatch</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m i</td>
<td class="org-left">org-toggle-item</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m t</td>
<td class="org-left">org-todo</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m B</td>
<td class="org-left">org-babel-tangle</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m T</td>
<td class="org-left">org-todo-list</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC n r f</td>
<td class="org-left">neotree-refresh</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC n c e</td>
<td class="org-left">neotree-create-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC n d n</td>
<td class="org-left">neotree-delete-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC n r n</td>
<td class="org-left">neotree-rename-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m b -</td>
<td class="org-left">org-table-insert-hline</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC m d t</td>
<td class="org-left">org-time-stamp</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC o d</td>
<td class="org-left">dashboard-open</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC o f</td>
<td class="org-left">make-frame</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC o F</td>
<td class="org-left">select-frame-by-name</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC p</td>
<td class="org-left">projectile-command-map</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC s d</td>
<td class="org-left">dictionary-search</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC s m</td>
<td class="org-left">man</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC s t</td>
<td class="org-left">tldr</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC s w</td>
<td class="org-left">woman</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t e</td>
<td class="org-left">eshell-toggle</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t f</td>
<td class="org-left">flycheck-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t l</td>
<td class="org-left">display-line-numbers-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t n</td>
<td class="org-left">neotree-toggle</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t o</td>
<td class="org-left">org-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t r</td>
<td class="org-left">rainbow-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t t</td>
<td class="org-left">visual-line-mode</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC t v</td>
<td class="org-left">vterm-toggle</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w c</td>
<td class="org-left">evil-window-delete</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w n</td>
<td class="org-left">evil-window-new</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w s</td>
<td class="org-left">evil-window-split</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w v</td>
<td class="org-left">evil-window-vsplit</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w h</td>
<td class="org-left">evil-window-left</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w j</td>
<td class="org-left">evil-window-down</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w k</td>
<td class="org-left">evil-window-up</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w l</td>
<td class="org-left">evil-window-right</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w w</td>
<td class="org-left">evil-window-next</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w H</td>
<td class="org-left">buf-move-left</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w J</td>
<td class="org-left">buf-move-down</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w K</td>
<td class="org-left">buf-move-up</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">SPC w L</td>
<td class="org-left">buf-move-right</td>
<td class="org-left">general.el</td>
</tr>

<tr>
<td class="org-left">C-S-a</td>
<td class="org-left">embark-act</td>
<td class="org-left">:bind in embark</td>
</tr>

<tr>
<td class="org-left">C-h B</td>
<td class="org-left">embark-bindings</td>
<td class="org-left">:bind in embark</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">consult-flycheck</td>
<td class="org-left">flycheck-command-map</td>
</tr>

<tr>
<td class="org-left">M-/</td>
<td class="org-left">evilnc-comment-or-uncomment-lines</td>
<td class="org-left">global-set-key</td>
</tr>
</tbody>
</table>
</div>
</div>
